centrevillage/igb_sdk/igb_stm32/periph/adc.hpp
#pragma once

#include <stddef.h>

#include <igb_stm32/base.hpp>
#include <igb_util/cast.hpp>
#include <igb_stm32/periph/gpio.hpp>
#include <igb_stm32/periph/rcc.hpp>
#include <igb_util/macro.hpp>
#include <igb_util/reg.hpp>
#include <igb_stm32/periph/systick.hpp>
#include <igb_stm32/periph/nvic.hpp>

#define ADC_CR_BITS_PROPERTY_RS (ADC_CR_ADCAL | ADC_CR_JADSTP | ADC_CR_ADSTP | ADC_CR_JADSTART | ADC_CR_ADSTART | ADC_CR_ADDIS | ADC_CR_ADEN) /* ADC register CR bits with HW property "rs": Software can read as well as set this bit. Writing '0' has no effect on the bit value. */

namespace igb {
namespace stm32 {

#define IGB_ADC ((ADC_TypeDef*)addr)
#define IGB_ADC_REG_ADDR(member) (addr + offsetof(ADC_TypeDef, member))
#define IGB_ADC_REG(member) ((ADC_TypeDef*)IGB_ADC_REG_ADDR(member))

#define IGB_ADC_COMMON ((ADC_Common_TypeDef*)addr)
#define IGB_ADC_COMMON_REG_ADDR(member) (addr + offsetof(ADC_Common_TypeDef, member))
#define IGB_ADC_COMMON_REG(member) ((ADC_Common_TypeDef*)IGB_ADC_REG_ADDR(member))

// TODO: other series
#if defined(STM32F3) || defined(STM32G431xx)

#if defined(STM32G431xx)

#define ADC1_2_COMMON_BASE ADC12_COMMON_BASE
#define ADC12_CSR_ADRDY_MST_Pos ADC_CSR_ADRDY_MST_Pos
#define ADC12_CSR_ADRDY_MST_Msk ADC_CSR_ADRDY_MST_Msk
#define ADC12_CSR_ADRDY_MST ADC_CSR_ADRDY_MST
#define ADC12_CSR_ADRDY_EOSMP_MST_Pos ADC_CSR_EOSMP_MST_Pos
#define ADC12_CSR_ADRDY_EOSMP_MST_Msk ADC_CSR_EOSMP_MST_Msk
#define ADC12_CSR_ADRDY_EOSMP_MST ADC_CSR_EOSMP_MST
#define ADC12_CSR_ADRDY_EOC_MST_Pos ADC_CSR_EOC_MST_Pos
#define ADC12_CSR_ADRDY_EOC_MST_Msk ADC_CSR_EOC_MST_Msk
#define ADC12_CSR_ADRDY_EOC_MST ADC_CSR_EOC_MST
#define ADC12_CSR_ADRDY_EOS_MST_Pos ADC_CSR_EOS_MST_Pos
#define ADC12_CSR_ADRDY_EOS_MST_Msk ADC_CSR_EOS_MST_Msk
#define ADC12_CSR_ADRDY_EOS_MST ADC_CSR_EOS_MST
#define ADC12_CSR_ADRDY_OVR_MST_Pos ADC_CSR_OVR_MST_Pos
#define ADC12_CSR_ADRDY_OVR_MST_Msk ADC_CSR_OVR_MST_Msk
#define ADC12_CSR_ADRDY_OVR_MST ADC_CSR_OVR_MST
#define ADC12_CSR_ADRDY_JEOC_MST_Pos ADC_CSR_JEOC_MST_Pos
#define ADC12_CSR_ADRDY_JEOC_MST_Msk ADC_CSR_JEOC_MST_Msk
#define ADC12_CSR_ADRDY_JEOC_MST ADC_CSR_JEOC_MST
#define ADC12_CSR_ADRDY_JEOS_MST_Pos ADC_CSR_JEOS_MST_Pos
#define ADC12_CSR_ADRDY_JEOS_MST_Msk ADC_CSR_JEOS_MST_Msk
#define ADC12_CSR_ADRDY_JEOS_MST ADC_CSR_JEOS_MST
#define ADC12_CSR_AWD1_MST_Pos ADC_CSR_AWD1_MST_Pos
#define ADC12_CSR_AWD1_MST_Msk ADC_CSR_AWD1_MST_Msk
#define ADC12_CSR_AWD1_MST ADC_CSR_AWD1_MST
#define ADC12_CSR_AWD2_MST_Pos ADC_CSR_AWD2_MST_Pos
#define ADC12_CSR_AWD2_MST_Msk ADC_CSR_AWD2_MST_Msk
#define ADC12_CSR_AWD2_MST ADC_CSR_AWD2_MST
#define ADC12_CSR_AWD3_MST_Pos ADC_CSR_AWD3_MST_Pos
#define ADC12_CSR_AWD3_MST_Msk ADC_CSR_AWD3_MST_Msk
#define ADC12_CSR_AWD3_MST ADC_CSR_AWD3_MST
#define ADC12_CSR_JQOVF_MST_Pos ADC_CSR_JQOVF_MST_Pos
#define ADC12_CSR_JQOVF_MST_Msk ADC_CSR_JQOVF_MST_Msk
#define ADC12_CSR_JQOVF_MST ADC_CSR_JQOVF_MST
#define ADC12_CSR_ADRDY_SLV_Pos ADC_CSR_ADRDY_SLV_Pos
#define ADC12_CSR_ADRDY_SLV_Msk ADC_CSR_ADRDY_SLV_Msk
#define ADC12_CSR_ADRDY_SLV ADC_CSR_ADRDY_SLV
#define ADC12_CSR_ADRDY_EOSMP_SLV_Pos ADC_CSR_EOSMP_SLV_Pos
#define ADC12_CSR_ADRDY_EOSMP_SLV_Msk ADC_CSR_EOSMP_SLV_Msk
#define ADC12_CSR_ADRDY_EOSMP_SLV ADC_CSR_EOSMP_SLV
#define ADC12_CSR_ADRDY_EOC_SLV_Pos ADC_CSR_EOC_SLV_Pos
#define ADC12_CSR_ADRDY_EOC_SLV_Msk ADC_CSR_EOC_SLV_Msk
#define ADC12_CSR_ADRDY_EOC_SLV ADC_CSR_EOC_SLV
#define ADC12_CSR_ADRDY_EOS_SLV_Pos ADC_CSR_EOS_SLV_Pos
#define ADC12_CSR_ADRDY_EOS_SLV_Msk ADC_CSR_EOS_SLV_Msk
#define ADC12_CSR_ADRDY_EOS_SLV ADC_CSR_EOS_SLV
#define ADC12_CSR_ADRDY_OVR_SLV_Pos ADC_CSR_OVR_SLV_Pos
#define ADC12_CSR_ADRDY_OVR_SLV_Msk ADC_CSR_OVR_SLV_Msk
#define ADC12_CSR_ADRDY_OVR_SLV ADC_CSR_OVR_SLV
#define ADC12_CSR_ADRDY_JEOC_SLV_Pos ADC_CSR_JEOC_SLV_Pos
#define ADC12_CSR_ADRDY_JEOC_SLV_Msk ADC_CSR_JEOC_SLV_Msk
#define ADC12_CSR_ADRDY_JEOC_SLV ADC_CSR_JEOC_SLV
#define ADC12_CSR_ADRDY_JEOS_SLV_Pos ADC_CSR_JEOS_SLV_Pos
#define ADC12_CSR_ADRDY_JEOS_SLV_Msk ADC_CSR_JEOS_SLV_Msk
#define ADC12_CSR_ADRDY_JEOS_SLV ADC_CSR_JEOS_SLV
#define ADC12_CSR_AWD1_SLV_Pos ADC_CSR_AWD1_SLV_Pos
#define ADC12_CSR_AWD1_SLV_Msk ADC_CSR_AWD1_SLV_Msk
#define ADC12_CSR_AWD1_SLV ADC_CSR_AWD1_SLV
#define ADC12_CSR_AWD2_SLV_Pos ADC_CSR_AWD2_SLV_Pos
#define ADC12_CSR_AWD2_SLV_Msk ADC_CSR_AWD2_SLV_Msk
#define ADC12_CSR_AWD2_SLV ADC_CSR_AWD2_SLV
#define ADC12_CSR_AWD3_SLV_Pos ADC_CSR_AWD3_SLV_Pos
#define ADC12_CSR_AWD3_SLV_Msk ADC_CSR_AWD3_SLV_Msk
#define ADC12_CSR_AWD3_SLV ADC_CSR_AWD3_SLV
#define ADC12_CSR_JQOVF_SLV_Pos ADC_CSR_JQOVF_SLV_Pos
#define ADC12_CSR_JQOVF_SLV_Msk ADC_CSR_JQOVF_SLV_Msk
#define ADC12_CSR_JQOVF_SLV ADC_CSR_JQOVF_SLV
#define ADC12_CCR_MULTI_Pos ADC_CCR_DUAL_Pos
#define ADC12_CCR_MULTI_Msk ADC_CCR_DUAL_Msk
#define ADC12_CCR_MULTI ADC_CCR_DUAL
#define ADC12_CCR_MULTI_0 ADC_CCR_DUAL_0
#define ADC12_CCR_MULTI_1 ADC_CCR_DUAL_1
#define ADC12_CCR_MULTI_2 ADC_CCR_DUAL_2
#define ADC12_CCR_MULTI_3 ADC_CCR_DUAL_3
#define ADC12_CCR_MULTI_4 ADC_CCR_DUAL_4
#define ADC12_CCR_DELAY_Pos ADC_CCR_DELAY_Pos
#define ADC12_CCR_DELAY_Msk ADC_CCR_DELAY_Msk
#define ADC12_CCR_DELAY ADC_CCR_DELAY
#define ADC12_CCR_DELAY_0 ADC_CCR_DELAY_0
#define ADC12_CCR_DELAY_1 ADC_CCR_DELAY_1
#define ADC12_CCR_DELAY_2 ADC_CCR_DELAY_2
#define ADC12_CCR_DELAY_3 ADC_CCR_DELAY_3
#define ADC12_CCR_DMACFG_Pos ADC_CCR_DMACFG_Pos
#define ADC12_CCR_DMACFG_Msk ADC_CCR_DMACFG_Msk
#define ADC12_CCR_DMACFG ADC_CCR_DMACFG
#define ADC12_CCR_MDMA_Pos ADC_CCR_MDMA_Pos
#define ADC12_CCR_MDMA_Msk ADC_CCR_MDMA_Msk
#define ADC12_CCR_MDMA ADC_CCR_MDMA
#define ADC12_CCR_MDMA_0 ADC_CCR_MDMA_0
#define ADC12_CCR_MDMA_1 ADC_CCR_MDMA_1
#define ADC12_CCR_CKMODE_Pos ADC_CCR_CKMODE_Pos
#define ADC12_CCR_CKMODE_Msk ADC_CCR_CKMODE_Msk
#define ADC12_CCR_CKMODE ADC_CCR_CKMODE
#define ADC12_CCR_CKMODE_0 ADC_CCR_CKMODE_0
#define ADC12_CCR_CKMODE_1 ADC_CCR_CKMODE_1
#define ADC12_CCR_VREFEN_Pos ADC_CCR_VREFEN_Pos
#define ADC12_CCR_VREFEN_Msk ADC_CCR_VREFEN_Msk
#define ADC12_CCR_VREFEN ADC_CCR_VREFEN
#define ADC12_CCR_TSEN_Pos ADC_CCR_VSENSESEL_Pos
#define ADC12_CCR_TSEN_Msk ADC_CCR_VSENSESEL_Msk
#define ADC12_CCR_TSEN ADC_CCR_VSENSESEL
#define ADC12_CCR_VBATEN_Pos ADC_CCR_VBATSEL_Pos
#define ADC12_CCR_VBATEN_Msk ADC_CCR_VBATSEL_Msk
#define ADC12_CCR_VBATEN ADC_CCR_VBATSEL
#define ADC12_CDR_RDATA_MST_Pos ADC_CDR_RDATA_MST_Pos
#define ADC12_CDR_RDATA_MST_Msk ADC_CDR_RDATA_MST_Msk
#define ADC12_CDR_RDATA_MST ADC_CDR_RDATA_MST
#define ADC12_CDR_RDATA_MST_0 ADC_CDR_RDATA_MST_0
#define ADC12_CDR_RDATA_MST_1 ADC_CDR_RDATA_MST_1
#define ADC12_CDR_RDATA_MST_2 ADC_CDR_RDATA_MST_2
#define ADC12_CDR_RDATA_MST_3 ADC_CDR_RDATA_MST_3
#define ADC12_CDR_RDATA_MST_4 ADC_CDR_RDATA_MST_4
#define ADC12_CDR_RDATA_MST_5 ADC_CDR_RDATA_MST_5
#define ADC12_CDR_RDATA_MST_6 ADC_CDR_RDATA_MST_6
#define ADC12_CDR_RDATA_MST_7 ADC_CDR_RDATA_MST_7
#define ADC12_CDR_RDATA_MST_8 ADC_CDR_RDATA_MST_8
#define ADC12_CDR_RDATA_MST_9 ADC_CDR_RDATA_MST_9
#define ADC12_CDR_RDATA_MST_10 ADC_CDR_RDATA_MST_10
#define ADC12_CDR_RDATA_MST_11 ADC_CDR_RDATA_MST_11
#define ADC12_CDR_RDATA_MST_12 ADC_CDR_RDATA_MST_12
#define ADC12_CDR_RDATA_MST_13 ADC_CDR_RDATA_MST_13
#define ADC12_CDR_RDATA_MST_14 ADC_CDR_RDATA_MST_14
#define ADC12_CDR_RDATA_MST_15 ADC_CDR_RDATA_MST_15
#define ADC12_CDR_RDATA_SLV_Pos ADC_CDR_RDATA_SLV_Pos
#define ADC12_CDR_RDATA_SLV_Msk ADC_CDR_RDATA_SLV_Msk
#define ADC12_CDR_RDATA_SLV ADC_CDR_RDATA_SLV
#define ADC12_CDR_RDATA_SLV_0 ADC_CDR_RDATA_SLV_0
#define ADC12_CDR_RDATA_SLV_1 ADC_CDR_RDATA_SLV_1
#define ADC12_CDR_RDATA_SLV_2 ADC_CDR_RDATA_SLV_2
#define ADC12_CDR_RDATA_SLV_3 ADC_CDR_RDATA_SLV_3
#define ADC12_CDR_RDATA_SLV_4 ADC_CDR_RDATA_SLV_4
#define ADC12_CDR_RDATA_SLV_5 ADC_CDR_RDATA_SLV_5
#define ADC12_CDR_RDATA_SLV_6 ADC_CDR_RDATA_SLV_6
#define ADC12_CDR_RDATA_SLV_7 ADC_CDR_RDATA_SLV_7
#define ADC12_CDR_RDATA_SLV_8 ADC_CDR_RDATA_SLV_8
#define ADC12_CDR_RDATA_SLV_9 ADC_CDR_RDATA_SLV_9
#define ADC12_CDR_RDATA_SLV_10 ADC_CDR_RDATA_SLV_10
#define ADC12_CDR_RDATA_SLV_11 ADC_CDR_RDATA_SLV_11
#define ADC12_CDR_RDATA_SLV_12 ADC_CDR_RDATA_SLV_12
#define ADC12_CDR_RDATA_SLV_13 ADC_CDR_RDATA_SLV_13
#define ADC12_CDR_RDATA_SLV_14 ADC_CDR_RDATA_SLV_14
#define ADC12_CDR_RDATA_SLV_15 ADC_CDR_RDATA_SLV_15

#endif

enum class AdcStatus : uint32_t {
  ready = ADC_ISR_ADRDY,
  endOfSampling = ADC_ISR_EOSMP,
  endOfConversion = ADC_ISR_EOC,
  endOfSeqConversions = ADC_ISR_EOS,
  overrun = ADC_ISR_OVR,
  injectedEndOfConversion = ADC_ISR_JEOC,
  analogWatchdog1 = ADC_ISR_AWD1,
  analogWatchdog2 = ADC_ISR_AWD2,
  analogWatchdog3 = ADC_ISR_AWD3,
  injectedQueueOverflow = ADC_ISR_JQOVF,
};

enum class AdcCommonStatus : uint32_t {
  readyOnMaster = ADC12_CSR_ADRDY_MST,
  endOfSamplingOnMaster = ADC12_CSR_ADRDY_EOSMP_MST,
  endOfConversionOnMaster = ADC12_CSR_ADRDY_EOC_MST,
  endOfSeqConversionsOnMaster = ADC12_CSR_ADRDY_EOS_MST,
  overrunOnMaster = ADC12_CSR_ADRDY_OVR_MST,
  injectedEndOfConversionOnMaster = ADC12_CSR_ADRDY_JEOC_MST,
  injectedEndOfSeqConversionOnMaster = ADC12_CSR_ADRDY_JEOS_MST,
  analogWatchdog1OnMaster = ADC12_CSR_AWD1_MST,
  analogWatchdog2OnMaster = ADC12_CSR_AWD2_MST,
  analogWatchdog3OnMaster = ADC12_CSR_AWD3_MST,
  injectedQueueOverflowOnMaster = ADC12_CSR_JQOVF_MST,

  readyOnSlave = ADC12_CSR_ADRDY_SLV,
  endOfSamplingOnSlave = ADC12_CSR_ADRDY_EOSMP_SLV,
  endOfConversionOnSlave = ADC12_CSR_ADRDY_EOC_SLV,
  endOfSeqConversionsOnSlave = ADC12_CSR_ADRDY_EOS_SLV,
  overrunOnSlave = ADC12_CSR_ADRDY_OVR_SLV,
  injectedEndOfConversionOnSlave = ADC12_CSR_ADRDY_JEOC_SLV,
  injectedEndOfSeqConversionOnSlave = ADC12_CSR_ADRDY_JEOS_SLV,
  analogWatchdog1OnSlave = ADC12_CSR_AWD1_SLV,
  analogWatchdog2OnSlave = ADC12_CSR_AWD2_SLV,
  analogWatchdog3OnSlave = ADC12_CSR_AWD3_SLV,
  injectedQueueOverflowOnSlave = ADC12_CSR_JQOVF_SLV,
};

enum class AdcInterruptType : uint32_t {
  ready = ADC_IER_ADRDYIE,
  endOfSampling = ADC_IER_EOSMPIE,
  endOfConversion = ADC_IER_EOCIE,
  endOfSeqConversions = ADC_IER_EOSIE,
  overrun = ADC_IER_OVRIE,
  injectedEndOfConversion = ADC_IER_JEOCIE,
  injectedEndOfSeqConversions = ADC_IER_JEOSIE,
  analogWatchdog1 = ADC_IER_AWD1IE,
  analogWatchdog2 = ADC_IER_AWD2IE,
  analogWatchdog3 = ADC_IER_AWD3IE,
  injectedQueueOverflow = ADC_IER_JQOVFIE,
};

enum class AdcCalibrationType : uint32_t {
  singleEnded = ADC_CALFACT_CALFACT_S,
  differentialEnded = ADC_CR_ADCALDIF | ADC_CALFACT_CALFACT_D,
  single_and_differential = ADC_CALFACT_CALFACT_S | ADC_CR_ADCALDIF | ADC_CALFACT_CALFACT_D
};

enum class AdcRegulatorState : uint32_t {
  clear = 0,
  enable = 1,
  disable = 2,
};

enum class AdcDmaConfig : uint32_t {
  oneshot = 0,
  circular = ADC_CFGR_DMACFG
};

enum class AdcResolution : uint32_t {
  _12bit = 0,
  _10bit = ADC_CFGR_RES_0,
  _8bit  = ADC_CFGR_RES_1,
  _6bit  = ADC_CFGR_RES_0 | ADC_CFGR_RES_1,
};

