centrevillage/igb_sdk/igb_stm32/periph/adc.hpp
enum class AdcDataAlign : uint32_t {
  right = 0,
  left = ADC_CFGR_ALIGN
};

enum class AdcExternalTriggerPolarity : uint32_t {
  disable = 0,
  risingEdge = ADC_CFGR_EXTEN_0,
  fallingEdge = ADC_CFGR_EXTEN_1,
  bothEdges = ADC_CFGR_EXTEN_0 | ADC_CFGR_EXTEN_1,
};

enum class AdcOverrunMode : uint32_t {
  keepOldData = 0,
  overwriteByNewData = ADC_CFGR_OVRMOD
};

enum class AdcJsqrMode : uint32_t {
  keepOld = 0,
  discardOld = ADC_CFGR_JQM
};

#if defined(STM32G431xx)
enum class AdcOverSamplingRate : uint32_t {
  x2 = 0,
  x4,
  x8,
  x16,
  x32,
  x64,
  x128,
  x256
};

enum class AdcOverSamplingShift : uint32_t {
  none = 0,
  _1bit,
  _2bit,
  _3bit,
  _4bit,
  _5bit,
  _6bit,
  _7bit,
  _8bit,
};

enum class AdcRegularOverSamplingMode : uint32_t {
  continuous = 0,
  discontinuous = 1
};

#endif

enum class AdcCommonDualMode : uint32_t {
  independent = 0,
  syncRegularAndInject = 1,
  syncRegularAndAltenateTrig = 2,
  syncInterleaveAndInject = 3,
  reserved = 4,
  syncInject = 5,
  syncRegular = 6,
  syncInterleave = 7,
  alternateTrig = 9,
};

enum class AdcInjectGrpExtTrigMode : uint32_t {
  noTrig = 0,
  risingEdge = ADC_JSQR_JEXTEN_0,
  fallingEdge = ADC_JSQR_JEXTEN_1,
  bothEdge = ADC_JSQR_JEXTEN_0 | ADC_JSQR_JEXTEN_1
};

enum class AdcCommonDmaMode : uint32_t {
  oneshot = 0,
  circular = ADC12_CCR_DMACFG
};

enum class AdcCommonMdmaMode : uint32_t {
  disable = 0,
  reserved = 1,
  enable12or10bit = 2,
  enable8or6bit = 3,
};


enum class AdcCommonClockMode : uint32_t {
  async = 0,
  syncHclkDiv1 = ADC12_CCR_CKMODE_0,
  syncHclkDiv2 = ADC12_CCR_CKMODE_1,
  syncHclkDiv4 = ADC12_CCR_CKMODE_0 | ADC12_CCR_CKMODE_1,
};

#if defined(STM32G431xx)
enum class AdcCommonPrescaler : uint32_t {
  div1 = 0,
  div2,
  div4,
  div6,
  div8,
  div10,
  div12,
  div16,
  div32,
  div64,
  div128,
  div256,
};
#endif

struct AdcCommon {
  constexpr static auto addr = ADC1_2_COMMON_BASE;

  RegEnum<IGB_ADC_COMMON_REG_ADDR(CCR), ADC12_CCR_MULTI_Msk, AdcCommonDualMode> dualMode;
  RegValue<IGB_ADC_COMMON_REG_ADDR(CCR), ADC12_CCR_DELAY_Msk, ADC12_CCR_DELAY_Pos> samplingPhaseDelay;
  RegEnum<IGB_ADC_COMMON_REG_ADDR(CCR), ADC12_CCR_DMACFG_Msk, AdcCommonDmaMode> dmaMode;
  RegEnum<IGB_ADC_COMMON_REG_ADDR(CCR), ADC12_CCR_MDMA_Msk, AdcCommonMdmaMode> mdmaMode;
  RegEnum<IGB_ADC_COMMON_REG_ADDR(CCR), ADC12_CCR_CKMODE_Msk, AdcCommonClockMode> clockMode;
  RegFlag<IGB_ADC_COMMON_REG_ADDR(CCR), ADC12_CCR_VREFEN> vrefint;
  RegFlag<IGB_ADC_COMMON_REG_ADDR(CCR), ADC12_CCR_TSEN> temperatureSensor;
  RegFlag<IGB_ADC_COMMON_REG_ADDR(CCR), ADC12_CCR_VBATEN> vbat;
#if defined(STM32G431xx)
  RegEnum<IGB_ADC_COMMON_REG_ADDR(CCR), ADC_CCR_PRESC_Msk, AdcCommonPrescaler, ADC_CCR_PRESC_Pos> prescaler;
#endif

  RegValue<IGB_ADC_COMMON_REG_ADDR(CDR), ADC12_CDR_RDATA_MST_Msk, ADC12_CDR_RDATA_MST_Pos> masterData;
  RegValue<IGB_ADC_COMMON_REG_ADDR(CDR), ADC12_CDR_RDATA_SLV_Msk, ADC12_CDR_RDATA_SLV_Pos> slaveData;

  IGB_FAST_INLINE bool is(AdcCommonStatus status) {
    volatile bool result = IGB_ADC_COMMON->CSR & static_cast<uint32_t>(status);
    return result;
  }
};

enum class AdcChannel : uint32_t {
  ch1 = 1,
  ch2,
  ch3,
  ch4,
  ch5,
  ch6,
  ch7,
  ch8,
  ch9,
  ch10,
  ch11,
  ch12,
  ch13,
  ch14,
  ch15,
  ch16,
  ch17,
  ch18,
};

struct AdcConf {
  AdcResolution resolution = AdcResolution::_12bit;
  AdcDataAlign data_align = AdcDataAlign::right;
  bool auto_delay_mode = false;
  uint8_t external_trigger_select = 0;
  AdcExternalTriggerPolarity external_trigger_polarity = AdcExternalTriggerPolarity::disable;
  bool discontinuous_conv_mode = false;
  uint8_t discontinuous_conv_channel_count = 0;
  bool continuous_conv_mode = false;
  bool dma = false;
  AdcDmaConfig dma_config = AdcDmaConfig::oneshot;
  AdcOverrunMode overrun_mode = AdcOverrunMode::overwriteByNewData;
  AdcCommonClockMode clock_mode = AdcCommonClockMode::async;
  bool vrefint = false;
  bool temperature_sensor = false;
  bool vbat = false;
  AdcCalibrationType calibration_type = AdcCalibrationType::singleEnded;
  bool enable_interrupt = false;
  uint32_t interrupt_bits = static_cast<uint32_t>(AdcInterruptType::endOfConversion);
  bool interrupt_priority = 1;
};

enum class AdcSamplingTime : uint8_t {
  clock1 = 0,
  clock2,
  clock4,
  clock7,
  clock19,
  clock61,
  clock181,
  clock601,
};

struct AdcPinConf {
  AdcChannel ch;
  GpioPinType pin_type;
  AdcSamplingTime sampling_time = AdcSamplingTime::clock19;
};


template<AdcType ADC_TYPE>
struct Adc {
  constexpr static auto type = ADC_TYPE;
  constexpr static auto info = STM32_PERIPH_INFO.adc[to_idx(type)];
  constexpr static auto addr = STM32_PERIPH_INFO.adc[to_idx(type)].addr;
  constexpr static auto addr_CR = IGB_ADC_REG_ADDR(CR);
  constexpr static auto addr_DR = IGB_ADC_REG_ADDR(DR);
  constexpr static auto addr_ISR = IGB_ADC_REG_ADDR(ISR);
  constexpr static auto addr_IER = IGB_ADC_REG_ADDR(IER);
  constexpr static auto addr_CFGR = IGB_ADC_REG_ADDR(CFGR);
#if defined(STM32G431xx)
  constexpr static auto addr_CFGR2 = IGB_ADC_REG_ADDR(CFGR2);
#endif
  constexpr static auto addr_SMPR1 = IGB_ADC_REG_ADDR(SMPR1);
  constexpr static auto addr_SMPR2 = IGB_ADC_REG_ADDR(SMPR2);
  constexpr static auto addr_TR1 = IGB_ADC_REG_ADDR(TR1);
  constexpr static auto addr_TR2 = IGB_ADC_REG_ADDR(TR2);
  constexpr static auto addr_TR3 = IGB_ADC_REG_ADDR(TR3);
  constexpr static auto addr_SQR1 = IGB_ADC_REG_ADDR(SQR1);
  constexpr static auto addr_SQR2 = IGB_ADC_REG_ADDR(SQR2);
  constexpr static auto addr_SQR3 = IGB_ADC_REG_ADDR(SQR3);
  constexpr static auto addr_SQR4 = IGB_ADC_REG_ADDR(SQR4);
  constexpr static auto addr_JSQR = IGB_ADC_REG_ADDR(JSQR);
  constexpr static auto addr_OFR1 = IGB_ADC_REG_ADDR(OFR1);
  constexpr static auto addr_OFR2 = IGB_ADC_REG_ADDR(OFR2);
  constexpr static auto addr_OFR3 = IGB_ADC_REG_ADDR(OFR3);
  constexpr static auto addr_OFR4 = IGB_ADC_REG_ADDR(OFR4);
  constexpr static auto addr_JDR1 = IGB_ADC_REG_ADDR(JDR1);
  constexpr static auto addr_JDR2 = IGB_ADC_REG_ADDR(JDR2);
  constexpr static auto addr_JDR3 = IGB_ADC_REG_ADDR(JDR3);
  constexpr static auto addr_JDR4 = IGB_ADC_REG_ADDR(JDR4);
  constexpr static auto addr_AWD2CR = IGB_ADC_REG_ADDR(AWD2CR);
  constexpr static auto addr_AWD3CR = IGB_ADC_REG_ADDR(AWD3CR);
  constexpr static auto addr_DIFSEL = IGB_ADC_REG_ADDR(DIFSEL);
  constexpr static auto addr_CALFACT = IGB_ADC_REG_ADDR(CALFACT);

  RegValue<addr_CR, ADC_CR_BITS_PROPERTY_RS, 0> propertyRsClearBits;

  RegFlag<addr_CR, ADC_CR_ADSTART> convStart;
  RegFlag<addr_CR, ADC_CR_JADSTART> injectedConvStart;
  RegFlag<addr_CR, ADC_CR_ADSTP> convStop;
  RegFlag<addr_CR, ADC_CR_JADSTP> injectedConvStop;
  RegEnum<addr_CR, (0x3UL << ADC_CR_ADVREGEN_Pos), AdcRegulatorState, ADC_CR_ADVREGEN_Pos> regulator;
  RegFlag<addr_CR, ADC_CR_ADCALDIF> differentialCalibration;
  RegFlag<addr_CR, ADC_CR_ADCAL> calibration;

  RegFlag<addr_CFGR, ADC_CFGR_DMAEN> dma;
  RegEnum<addr_CFGR, ADC_CFGR_DMACFG_Msk, AdcDmaConfig> dmaConfig;
  RegEnum<addr_CFGR, ADC_CFGR_RES_Msk, AdcResolution> resolution;
  RegEnum<addr_CFGR, ADC_CFGR_ALIGN_Msk, AdcDataAlign> dataAlign;
  RegValue<addr_CFGR, ADC_CFGR_EXTSEL_Msk, ADC_CFGR_EXTSEL_Pos> externalTrigSelect;
  RegEnum<addr_CFGR, ADC_CFGR_EXTEN_Msk, AdcExternalTriggerPolarity> externalTrigPolarity;
  RegEnum<addr_CFGR, ADC_CFGR_OVRMOD_Msk, AdcOverrunMode> overrunMode;
  // ADC_CFGR_CONT and ADC_CFGR_DISCEN are must not on at same time!
  RegFlag<addr_CFGR, ADC_CFGR_CONT> continuousConvMode;
  RegFlag<addr_CFGR, ADC_CFGR_DISCEN> discontinuousConvMode;
  RegFlag<addr_CFGR, ADC_CFGR_AUTDLY> autoDelayMode;
  RegValue<addr_CFGR, ADC_CFGR_DISCNUM_Msk, ADC_CFGR_DISCNUM_Pos> discontinuousConvChannelCount; // 0 == 1 channel, 7 = 8 channnel
  RegFlag<addr_CFGR, ADC_CFGR_JDISCEN> injectedDiscontinuousMode;
  RegEnum<addr_CFGR, ADC_CFGR_JQM_Msk, AdcJsqrMode> jsqrMode;
  RegFlag<addr_CFGR, ADC_CFGR_AWD1SGL, false> watchdog1ForAllCh;
  RegFlag<addr_CFGR, ADC_CFGR_AWD1EN> regularWatchdog1;
  RegFlag<addr_CFGR, ADC_CFGR_JAWD1EN> injectWatchdog1;
  RegFlag<addr_CFGR, ADC_CFGR_JAUTO> autoInjectGroupConv;
  RegValue<addr_CFGR, ADC_CFGR_AWD1CH_Msk, ADC_CFGR_AWD1CH_Pos> watchdog1Channel; // 0 == reserved, 1 = channel1, 18 = channel18
#if defined(STM32G431xx)
  RegFlag<addr_CFGR, ADC_CFGR_JQDIS> disableInjectQue;

  RegFlag<addr_CFGR2, ADC_CFGR2_ROVSE> enableRegularOverSampling;
  RegFlag<addr_CFGR2, ADC_CFGR2_JOVSE> enableInjectOverSampling;
  RegEnum<addr_CFGR2, ADC_CFGR2_OVSR_Msk, AdcOverSamplingRate, ADC_CFGR2_OVSR_Pos> overSamplingRate;
  RegEnum<addr_CFGR2, ADC_CFGR2_OVSS_Msk, AdcOverSamplingShift, ADC_CFGR2_OVSS_Pos> overSamplingShift;
  RegFlag<addr_CFGR2, ADC_CFGR2_TROVS> triggerRegularOverSampling;
  RegEnum<addr_CFGR2, ADC_CFGR2_ROVSM_Msk, AdcRegularOverSamplingMode, ADC_CFGR2_ROVSM_Pos> regularOverSamplingMode;
  RegFlag<addr_CFGR2, ADC_CFGR2_GCOMP> enableGainCompensation;
  RegFlag<addr_CFGR2, ADC_CFGR2_SWTRIG> triggerSampleTimeControlMode;
  RegFlag<addr_CFGR2, ADC_CFGR2_BULB> enableBulbSamplingMode;
  RegFlag<addr_CFGR2, ADC_CFGR2_SMPTRIG> enableTriggerSampleTimeControlMode;
#endif
  
  RegValueRO<addr_DR, ADC_DR_RDATA_Msk, ADC_DR_RDATA_Pos> data; // read-only

  // sampling time value:
  // 0: 1.5 ADC Clock
  // 1: 2.5 ADC Clock
  // 2: 4.5 ADC Clock
  // 3: 7.5 ADC Clock
  // 4: 19.5 ADC Clock
  // 5: 61.5 ADC Clock
  // 6: 181.5 ADC Clock
  // 7: 601.5 ADC Clock
  RegValue<addr_SMPR1, ADC_SMPR1_SMP1_Msk, ADC_SMPR1_SMP1_Pos> ch1SamplingTime; // 0 ~ 7
  RegValue<addr_SMPR1, ADC_SMPR1_SMP2_Msk, ADC_SMPR1_SMP2_Pos> ch2SamplingTime; // 0 ~ 7
  RegValue<addr_SMPR1, ADC_SMPR1_SMP3_Msk, ADC_SMPR1_SMP3_Pos> ch3SamplingTime; // 0 ~ 7
  RegValue<addr_SMPR1, ADC_SMPR1_SMP4_Msk, ADC_SMPR1_SMP4_Pos> ch4SamplingTime; // 0 ~ 7
  RegValue<addr_SMPR1, ADC_SMPR1_SMP5_Msk, ADC_SMPR1_SMP5_Pos> ch5SamplingTime; // 0 ~ 7
  RegValue<addr_SMPR1, ADC_SMPR1_SMP6_Msk, ADC_SMPR1_SMP6_Pos> ch6SamplingTime; // 0 ~ 7
  RegValue<addr_SMPR1, ADC_SMPR1_SMP7_Msk, ADC_SMPR1_SMP7_Pos> ch7SamplingTime; // 0 ~ 7
  RegValue<addr_SMPR1, ADC_SMPR1_SMP8_Msk, ADC_SMPR1_SMP8_Pos> ch8SamplingTime; // 0 ~ 7
  RegValue<addr_SMPR1, ADC_SMPR1_SMP9_Msk, ADC_SMPR1_SMP9_Pos> ch9SamplingTime; // 0 ~ 7
  RegValue<addr_SMPR2, ADC_SMPR2_SMP10_Msk, ADC_SMPR2_SMP10_Pos> ch10SamplingTime; // 0 ~ 7
  RegValue<addr_SMPR2, ADC_SMPR2_SMP11_Msk, ADC_SMPR2_SMP11_Pos> ch11SamplingTime; // 0 ~ 7
  RegValue<addr_SMPR2, ADC_SMPR2_SMP12_Msk, ADC_SMPR2_SMP12_Pos> ch12SamplingTime; // 0 ~ 7
  RegValue<addr_SMPR2, ADC_SMPR2_SMP13_Msk, ADC_SMPR2_SMP13_Pos> ch13SamplingTime; // 0 ~ 7
  RegValue<addr_SMPR2, ADC_SMPR2_SMP14_Msk, ADC_SMPR2_SMP14_Pos> ch14SamplingTime; // 0 ~ 7
  RegValue<addr_SMPR2, ADC_SMPR2_SMP15_Msk, ADC_SMPR2_SMP15_Pos> ch15SamplingTime; // 0 ~ 7
  RegValue<addr_SMPR2, ADC_SMPR2_SMP16_Msk, ADC_SMPR2_SMP16_Pos> ch16SamplingTime; // 0 ~ 7
  RegValue<addr_SMPR2, ADC_SMPR2_SMP17_Msk, ADC_SMPR2_SMP17_Pos> ch17SamplingTime; // 0 ~ 7
  RegValue<addr_SMPR2, ADC_SMPR2_SMP18_Msk, ADC_SMPR2_SMP18_Pos> ch18SamplingTime; // 0 ~ 7
  
  RegValue<addr_TR1, ADC_TR1_LT1_Msk, ADC_TR1_LT1_Pos> watchdog1LowThreshold;
  RegValue<addr_TR1, ADC_TR1_HT1_Msk, ADC_TR1_HT1_Pos> watchdog1HighThreshold;
  RegValue<addr_TR2, ADC_TR2_LT2_Msk, ADC_TR2_LT2_Pos> watchdog2LowThreshold;
  RegValue<addr_TR2, ADC_TR2_HT2_Msk, ADC_TR2_HT2_Pos> watchdog2HighThreshold;
  RegValue<addr_TR3, ADC_TR3_LT3_Msk, ADC_TR3_LT3_Pos> watchdog3LowThreshold;
  RegValue<addr_TR3, ADC_TR3_HT3_Msk, ADC_TR3_HT3_Pos> watchdog3HighThreshold;

