centrevillage/igb_sdk/igb_stm32/periph/adc.hpp
  RegValue<addr_SQR1, ADC_SQR1_L_Msk, ADC_SQR1_L_Pos> seqChLength;
  RegValue<addr_SQR1, ADC_SQR1_SQ1_Msk, ADC_SQR1_SQ1_Pos> seqOrder1Ch; // 0 = reserved, 1 = channel1 ..., 18 = channel18
  RegValue<addr_SQR1, ADC_SQR1_SQ2_Msk, ADC_SQR1_SQ2_Pos> seqOrder2Ch; // 0 = reserved, 1 = channel1 ..., 18 = channel18
  RegValue<addr_SQR1, ADC_SQR1_SQ3_Msk, ADC_SQR1_SQ3_Pos> seqOrder3Ch; // 0 = reserved, 1 = channel1 ..., 18 = channel18
  RegValue<addr_SQR1, ADC_SQR1_SQ4_Msk, ADC_SQR1_SQ4_Pos> seqOrder4Ch; // 0 = reserved, 1 = channel1 ..., 18 = channel18
  RegValue<addr_SQR2, ADC_SQR2_SQ5_Msk, ADC_SQR2_SQ5_Pos> seqOrder5Ch; // 0 = reserved, 1 = channel1 ..., 18 = channel18
  RegValue<addr_SQR2, ADC_SQR2_SQ6_Msk, ADC_SQR2_SQ6_Pos> seqOrder6Ch; // 0 = reserved, 1 = channel1 ..., 18 = channel18
  RegValue<addr_SQR2, ADC_SQR2_SQ7_Msk, ADC_SQR2_SQ7_Pos> seqOrder7Ch; // 0 = reserved, 1 = channel1 ..., 18 = channel18
  RegValue<addr_SQR2, ADC_SQR2_SQ8_Msk, ADC_SQR2_SQ8_Pos> seqOrder8Ch; // 0 = reserved, 1 = channel1 ..., 18 = channel18
  RegValue<addr_SQR2, ADC_SQR2_SQ9_Msk, ADC_SQR2_SQ9_Pos> seqOrder9Ch; // 0 = reserved, 1 = channel1 ..., 18 = channel18
  RegValue<addr_SQR3, ADC_SQR3_SQ10_Msk, ADC_SQR3_SQ10_Pos> seqOrder10Ch; // 0 = reserved, 1 = channel1 ..., 18 = channel18
  RegValue<addr_SQR3, ADC_SQR3_SQ11_Msk, ADC_SQR3_SQ11_Pos> seqOrder11Ch; // 0 = reserved, 1 = channel1 ..., 18 = channel18
  RegValue<addr_SQR3, ADC_SQR3_SQ12_Msk, ADC_SQR3_SQ12_Pos> seqOrder12Ch; // 0 = reserved, 1 = channel1 ..., 18 = channel18
  RegValue<addr_SQR3, ADC_SQR3_SQ13_Msk, ADC_SQR3_SQ13_Pos> seqOrder13Ch; // 0 = reserved, 1 = channel1 ..., 18 = channel18
  RegValue<addr_SQR3, ADC_SQR3_SQ14_Msk, ADC_SQR3_SQ14_Pos> seqOrder14Ch; // 0 = reserved, 1 = channel1 ..., 18 = channel18
  RegValue<addr_SQR4, ADC_SQR4_SQ15_Msk, ADC_SQR4_SQ15_Pos> seqOrder15Ch; // 0 = reserved, 1 = channel1 ..., 18 = channel18
  RegValue<addr_SQR4, ADC_SQR4_SQ16_Msk, ADC_SQR4_SQ16_Pos> seqOrder16Ch; // 0 = reserved, 1 = channel1 ..., 18 = channel18

  RegValue<addr_JSQR, ADC_JSQR_JL_Msk, ADC_JSQR_JL_Pos> injectSeqChLength; // 0 =  1 conversion, 3 = 4 conversion
  RegValue<addr_JSQR, ADC_JSQR_JEXTSEL_Msk, ADC_JSQR_JEXTSEL_Pos> injectGrpExtTrig; // 0 = event0, 15 = event 15
  RegEnum<addr_JSQR, ADC_JSQR_JEXTEN_Msk, AdcInjectGrpExtTrigMode> injectGrpExtTrigMode;
  RegValue<addr_JSQR, ADC_JSQR_JSQ1_Msk, ADC_JSQR_JSQ1_Pos> injectSeqOrder1Ch; // 0 = reserved, 1 = channel1, 18 = channel18
  RegValue<addr_JSQR, ADC_JSQR_JSQ2_Msk, ADC_JSQR_JSQ2_Pos> injectSeqOrder2Ch; // 0 = reserved, 1 = channel1, 18 = channel18
  RegValue<addr_JSQR, ADC_JSQR_JSQ3_Msk, ADC_JSQR_JSQ3_Pos> injectSeqOrder3Ch; // 0 = reserved, 1 = channel1, 18 = channel18
  RegValue<addr_JSQR, ADC_JSQR_JSQ4_Msk, ADC_JSQR_JSQ4_Pos> injectSeqOrder4Ch; // 0 = reserved, 1 = channel1, 18 = channel18

  RegValue<addr_OFR1, ADC_OFR1_OFFSET1_Msk, ADC_OFR1_OFFSET1_Pos> dataOffset1Value;
  RegValue<addr_OFR1, ADC_OFR1_OFFSET1_CH_Msk, ADC_OFR1_OFFSET1_CH_Pos> dataOffset1Ch;
  RegFlag<addr_OFR1, ADC_OFR1_OFFSET1_EN> dataOffset1;

  RegValue<addr_OFR2, ADC_OFR2_OFFSET2_Msk, ADC_OFR2_OFFSET2_Pos> dataOffset2Value;
  RegValue<addr_OFR2, ADC_OFR2_OFFSET2_CH_Msk, ADC_OFR2_OFFSET2_CH_Pos> dataOffset2Ch;
  RegFlag<addr_OFR2, ADC_OFR2_OFFSET2_EN> dataOffset2;

  RegValue<addr_OFR3, ADC_OFR3_OFFSET3_Msk, ADC_OFR3_OFFSET3_Pos> dataOffset3Value;
  RegValue<addr_OFR3, ADC_OFR3_OFFSET3_CH_Msk, ADC_OFR3_OFFSET3_CH_Pos> dataOffset3Ch;
  RegFlag<addr_OFR3, ADC_OFR3_OFFSET3_EN> dataOffset3;

  RegValue<addr_OFR4, ADC_OFR4_OFFSET4_Msk, ADC_OFR4_OFFSET4_Pos> dataOffset4Value;
  RegValue<addr_OFR4, ADC_OFR4_OFFSET4_CH_Msk, ADC_OFR4_OFFSET4_CH_Pos> dataOffset4Ch;
  RegFlag<addr_OFR4, ADC_OFR4_OFFSET4_EN> dataOffset4;

  RegValue<addr_JDR1, ADC_JDR1_JDATA_Msk, ADC_JDR1_JDATA_Pos> injectData1;
  RegValue<addr_JDR2, ADC_JDR2_JDATA_Msk, ADC_JDR2_JDATA_Pos> injectData2;
  RegValue<addr_JDR3, ADC_JDR3_JDATA_Msk, ADC_JDR3_JDATA_Pos> injectData3;
  RegValue<addr_JDR4, ADC_JDR4_JDATA_Msk, ADC_JDR4_JDATA_Pos> injectData4;

  RegFlag<addr_AWD2CR, ADC_AWD2CR_AWD2CH_0> watchdog2Ch1Enable;
  RegFlag<addr_AWD2CR, ADC_AWD2CR_AWD2CH_1> watchdog2Ch2Enable;
  RegFlag<addr_AWD2CR, ADC_AWD2CR_AWD2CH_2> watchdog2Ch3Enable;
  RegFlag<addr_AWD2CR, ADC_AWD2CR_AWD2CH_3> watchdog2Ch4Enable;
  RegFlag<addr_AWD2CR, ADC_AWD2CR_AWD2CH_4> watchdog2Ch5Enable;
  RegFlag<addr_AWD2CR, ADC_AWD2CR_AWD2CH_5> watchdog2Ch6Enable;
  RegFlag<addr_AWD2CR, ADC_AWD2CR_AWD2CH_6> watchdog2Ch7Enable;
  RegFlag<addr_AWD2CR, ADC_AWD2CR_AWD2CH_7> watchdog2Ch8Enable;
  RegFlag<addr_AWD2CR, ADC_AWD2CR_AWD2CH_8> watchdog2Ch9Enable;
  RegFlag<addr_AWD2CR, ADC_AWD2CR_AWD2CH_9> watchdog2Ch10Enable;
  RegFlag<addr_AWD2CR, ADC_AWD2CR_AWD2CH_10> watchdog2Ch11Enable;
  RegFlag<addr_AWD2CR, ADC_AWD2CR_AWD2CH_11> watchdog2Ch12Enable;
  RegFlag<addr_AWD2CR, ADC_AWD2CR_AWD2CH_12> watchdog2Ch13Enable;
  RegFlag<addr_AWD2CR, ADC_AWD2CR_AWD2CH_13> watchdog2Ch14Enable;
  RegFlag<addr_AWD2CR, ADC_AWD2CR_AWD2CH_14> watchdog2Ch15Enable;
  RegFlag<addr_AWD2CR, ADC_AWD2CR_AWD2CH_15> watchdog2Ch16Enable;
  RegFlag<addr_AWD2CR, ADC_AWD2CR_AWD2CH_16> watchdog2Ch17Enable;
  RegFlag<addr_AWD2CR, ADC_AWD2CR_AWD2CH_17> watchdog2Ch18Enable;

  RegFlag<addr_AWD3CR, ADC_AWD3CR_AWD3CH_0> watchdog3Ch1Enable;
  RegFlag<addr_AWD3CR, ADC_AWD3CR_AWD3CH_1> watchdog3Ch2Enable;
  RegFlag<addr_AWD3CR, ADC_AWD3CR_AWD3CH_2> watchdog3Ch3Enable;
  RegFlag<addr_AWD3CR, ADC_AWD3CR_AWD3CH_3> watchdog3Ch4Enable;
  RegFlag<addr_AWD3CR, ADC_AWD3CR_AWD3CH_4> watchdog3Ch5Enable;
  RegFlag<addr_AWD3CR, ADC_AWD3CR_AWD3CH_5> watchdog3Ch6Enable;
  RegFlag<addr_AWD3CR, ADC_AWD3CR_AWD3CH_6> watchdog3Ch7Enable;
  RegFlag<addr_AWD3CR, ADC_AWD3CR_AWD3CH_7> watchdog3Ch8Enable;
  RegFlag<addr_AWD3CR, ADC_AWD3CR_AWD3CH_8> watchdog3Ch9Enable;
  RegFlag<addr_AWD3CR, ADC_AWD3CR_AWD3CH_9> watchdog3Ch10Enable;
  RegFlag<addr_AWD3CR, ADC_AWD3CR_AWD3CH_10> watchdog3Ch11Enable;
  RegFlag<addr_AWD3CR, ADC_AWD3CR_AWD3CH_11> watchdog3Ch12Enable;
  RegFlag<addr_AWD3CR, ADC_AWD3CR_AWD3CH_12> watchdog3Ch13Enable;
  RegFlag<addr_AWD3CR, ADC_AWD3CR_AWD3CH_13> watchdog3Ch14Enable;
  RegFlag<addr_AWD3CR, ADC_AWD3CR_AWD3CH_14> watchdog3Ch15Enable;
  RegFlag<addr_AWD3CR, ADC_AWD3CR_AWD3CH_15> watchdog3Ch16Enable;
  RegFlag<addr_AWD3CR, ADC_AWD3CR_AWD3CH_16> watchdog3Ch17Enable;
  RegFlag<addr_AWD3CR, ADC_AWD3CR_AWD3CH_17> watchdog3Ch18Enable;

  RegFlag<addr_DIFSEL, ADC_DIFSEL_DIFSEL_0> diffModeCh1Enable;
  RegFlag<addr_DIFSEL, ADC_DIFSEL_DIFSEL_1> diffModeCh2Enable;
  RegFlag<addr_DIFSEL, ADC_DIFSEL_DIFSEL_2> diffModeCh3Enable;
  RegFlag<addr_DIFSEL, ADC_DIFSEL_DIFSEL_3> diffModeCh4Enable;
  RegFlag<addr_DIFSEL, ADC_DIFSEL_DIFSEL_4> diffModeCh5Enable;
  RegFlag<addr_DIFSEL, ADC_DIFSEL_DIFSEL_5> diffModeCh6Enable;
  RegFlag<addr_DIFSEL, ADC_DIFSEL_DIFSEL_6> diffModeCh7Enable;
  RegFlag<addr_DIFSEL, ADC_DIFSEL_DIFSEL_7> diffModeCh8Enable;
  RegFlag<addr_DIFSEL, ADC_DIFSEL_DIFSEL_8> diffModeCh9Enable;
  RegFlag<addr_DIFSEL, ADC_DIFSEL_DIFSEL_9> diffModeCh10Enable;
  RegFlag<addr_DIFSEL, ADC_DIFSEL_DIFSEL_10> diffModeCh11Enable;
  RegFlag<addr_DIFSEL, ADC_DIFSEL_DIFSEL_11> diffModeCh12Enable;
  RegFlag<addr_DIFSEL, ADC_DIFSEL_DIFSEL_12> diffModeCh13Enable;
  RegFlag<addr_DIFSEL, ADC_DIFSEL_DIFSEL_13> diffModeCh14Enable;
  RegFlag<addr_DIFSEL, ADC_DIFSEL_DIFSEL_14> diffModeCh15Enable;
  RegFlag<addr_DIFSEL, ADC_DIFSEL_DIFSEL_15> diffModeCh16Enable;
  RegFlag<addr_DIFSEL, ADC_DIFSEL_DIFSEL_16> diffModeCh17Enable;
  RegFlag<addr_DIFSEL, ADC_DIFSEL_DIFSEL_17> diffModeCh18Enable;

  RegValue<addr_CALFACT, ADC_CALFACT_CALFACT_S_Msk, ADC_CALFACT_CALFACT_S_Pos> singleendCalibrationFactor;
  RegValue<addr_CALFACT, ADC_CALFACT_CALFACT_D_Msk, ADC_CALFACT_CALFACT_D_Pos> differentialCalibrationFactor;


  IGB_FAST_INLINE void enable() {
    IGB_MODIFY_REG(IGB_ADC->CR, ADC_CR_BITS_PROPERTY_RS, ADC_CR_ADEN);
  }

  IGB_FAST_INLINE void disable() {
    IGB_MODIFY_REG(IGB_ADC->CR, ADC_CR_BITS_PROPERTY_RS, ADC_CR_ADDIS);
  }

  IGB_FAST_INLINE bool is(AdcStatus status) {
    volatile bool result = IGB_ADC->ISR & static_cast<uint32_t>(status);
    return result;
  }

  IGB_FAST_INLINE void clear(AdcStatus status) {
    IGB_ADC->ISR = static_cast<uint32_t>(status);
  }

  IGB_FAST_INLINE void enableIt(AdcInterruptType interrupt) {
    IGB_ADC->IER = IGB_ADC->IER | static_cast<uint32_t>(interrupt);
  }

  IGB_FAST_INLINE void disableIt(AdcInterruptType interrupt) {
    IGB_ADC->IER = IGB_ADC->IER & ~(static_cast<uint32_t>(interrupt));
  }

  IGB_FAST_INLINE void enableRegulator() {
    regulator(AdcRegulatorState::clear);
    IGB_CLEAR_BIT(IGB_ADC->CR, ADC_CR_BITS_PROPERTY_RS);
    regulator(AdcRegulatorState::enable);
  }

  IGB_FAST_INLINE void disableRegulator() {
    IGB_CLEAR_BIT(IGB_ADC->CR, (ADC_CR_ADVREGEN | ADC_CR_BITS_PROPERTY_RS));
  }

  IGB_FAST_INLINE void startCalibration(AdcCalibrationType type) {
    IGB_MODIFY_REG(IGB_ADC->CR,
               ADC_CR_ADCALDIF | ADC_CR_BITS_PROPERTY_RS,
               ADC_CR_ADCAL | (static_cast<uint32_t>(type) & ADC_CR_ADCALDIF));
  }

