centrevillage/igb_sdk/igb_stm32/periph/adc.hpp
  IGB_FAST_INLINE void startConversion() {
    (propertyRsClearBits.val(0) | convStart.val(true)).update();
  }

  IGB_FAST_INLINE void startInjectedConversion() {
    (propertyRsClearBits.val(0) | injectedConvStart.val(true)).update();
  }

  IGB_FAST_INLINE void stopConversion() {
    (propertyRsClearBits.val(0) | convStop.val(true)).update();
  }

  IGB_FAST_INLINE void stopInjectedConversion() {
    (propertyRsClearBits.val(0) | injectedConvStop.val(true)).update();
  }

  IGB_FAST_INLINE uint16_t readData() { return data(); }

  static IGB_FAST_INLINE void enableBusClock() {
    STM32_PERIPH_INFO.adc[to_idx(type)].bus.enableBusClock();
  }

  static IGB_FAST_INLINE void prepareGpio(GpioPinType pin_type) {
    GpioPin pin = GpioPin::newPin(pin_type);
    pin.enable();
    pin.setMode(GpioMode::analog);
    pin.setPullMode(GpioPullMode::no);
  }

  static IGB_FAST_INLINE void prepareGpios(auto&& first, auto&&... rest) {
    prepareGpio(first.pin_type);
    prepareGpios(rest...);
  }
  static IGB_FAST_INLINE void prepareGpios() { }

  IGB_FAST_INLINE void _initCh(AdcPinConf pin_conf) {
    uint32_t smp = static_cast<uint32_t>(pin_conf.sampling_time);
    switch (pin_conf.ch) {
      case AdcChannel::ch1:
        ch1SamplingTime(smp);
        break;
      case AdcChannel::ch2:
        ch2SamplingTime(smp);
        break;
      case AdcChannel::ch3:
        ch3SamplingTime(smp);
        break;
      case AdcChannel::ch4:
        ch4SamplingTime(smp);
        break;
      case AdcChannel::ch5:
        ch5SamplingTime(smp);
        break;
      case AdcChannel::ch6:
        ch6SamplingTime(smp);
        break;
      case AdcChannel::ch7:
        ch7SamplingTime(smp);
        break;
      case AdcChannel::ch8:
        ch8SamplingTime(smp);
        break;
      case AdcChannel::ch9:
        ch9SamplingTime(smp);
        break;
      case AdcChannel::ch10:
        ch10SamplingTime(smp);
        break;
      case AdcChannel::ch11:
        ch11SamplingTime(smp);
        break;
      case AdcChannel::ch12:
        ch12SamplingTime(smp);
        break;
      case AdcChannel::ch13:
        ch13SamplingTime(smp);
        break;
      case AdcChannel::ch14:
        ch14SamplingTime(smp);
        break;
      case AdcChannel::ch15:
        ch15SamplingTime(smp);
        break;
      case AdcChannel::ch16:
        ch16SamplingTime(smp);
        break;
      case AdcChannel::ch17:
        ch17SamplingTime(smp);
        break;
      case AdcChannel::ch18:
        ch18SamplingTime(smp);
        break;
      default:
        break;
    }

    switch (pin_conf.ch) {
      case AdcChannel::ch1:
        diffModeCh1Enable(false);
        break;
      case AdcChannel::ch2:
        diffModeCh2Enable(false);
        break;
      case AdcChannel::ch3:
        diffModeCh3Enable(false);
        break;
      case AdcChannel::ch4:
        diffModeCh4Enable(false);
        break;
      case AdcChannel::ch5:
        diffModeCh5Enable(false);
        break;
      case AdcChannel::ch6:
        diffModeCh6Enable(false);
        break;
      case AdcChannel::ch7:
        diffModeCh7Enable(false);
        break;
      case AdcChannel::ch8:
        diffModeCh8Enable(false);
        break;
      case AdcChannel::ch9:
        diffModeCh9Enable(false);
        break;
      case AdcChannel::ch10:
        diffModeCh10Enable(false);
        break;
      case AdcChannel::ch11:
        diffModeCh11Enable(false);
        break;
      case AdcChannel::ch12:
        diffModeCh12Enable(false);
        break;
      case AdcChannel::ch13:
        diffModeCh13Enable(false);
        break;
      case AdcChannel::ch14:
        diffModeCh14Enable(false);
        break;
      case AdcChannel::ch15:
        diffModeCh15Enable(false);
        break;
      case AdcChannel::ch16:
        diffModeCh16Enable(false);
        break;
      case AdcChannel::ch17:
        diffModeCh17Enable(false);
        break;
      case AdcChannel::ch18:
        diffModeCh18Enable(false);
        break;
      default:
        break;
    }
  }

  IGB_FAST_INLINE void _initChannels(auto&& first, auto&&... rest) {
    _initCh(first);
    _initChannels(rest...);
  }
  IGB_FAST_INLINE void _initChannels() { }

  IGB_FAST_INLINE void _setSeqOrder(uint8_t idx, auto&& pin_conf) {
    uint32_t ch = static_cast<uint32_t>(pin_conf.ch);
    switch(idx) {
      case 0:
        seqOrder1Ch(ch);
        break;
      case 1:
        seqOrder2Ch(ch);
        break;
      case 2:
        seqOrder3Ch(ch);
        break;
      case 3:
        seqOrder4Ch(ch);
        break;
      case 4:
        seqOrder5Ch(ch);
        break;
      case 5:
        seqOrder6Ch(ch);
        break;
      case 6:
        seqOrder7Ch(ch);
        break;
      case 7:
        seqOrder8Ch(ch);
        break;
      case 8:
        seqOrder9Ch(ch);
        break;
      case 9:
        seqOrder10Ch(ch);
        break;
      case 10:
        seqOrder11Ch(ch);
        break;
      case 11:
        seqOrder12Ch(ch);
        break;
      case 12:
        seqOrder13Ch(ch);
        break;
      case 13:
        seqOrder14Ch(ch);
        break;
      case 14:
        seqOrder15Ch(ch);
        break;
      case 15:
        seqOrder16Ch(ch);
        break;
      default:
        break;
    }
  }

  IGB_FAST_INLINE void _setSeqOrders(uint8_t idx, auto&& first, auto&&... rest) {
    _setSeqOrder(idx, first);
    _setSeqOrders(idx+1, rest...);
  }
  IGB_FAST_INLINE void _setSeqOrders(uint8_t idx) { }


  IGB_FAST_INLINE void init(auto&& conf, auto&&... pin_confs) {
    enableBusClock();
    prepareGpios(pin_confs...);
    
    if (conf.enable_interrupt) {
      NvicCtrl::setPriority(info.irqn, conf.interrupt_priority);
      NvicCtrl::enable(info.irqn);
      IGB_ADC->IER = IGB_ADC->IER | conf.interrupt_bits;
    }

    (
     resolution.val(conf.resolution) |
     dataAlign.val(conf.data_align) | 
     autoDelayMode.val(conf.auto_delay_mode)
    ).update();

    (
     externalTrigSelect.val(conf.external_trigger_select) |
     externalTrigPolarity.val(conf.external_trigger_polarity) |
     discontinuousConvMode.val(conf.discontinuous_conv_mode) |
     discontinuousConvChannelCount.val(conf.discontinuous_conv_channel_count) |
     continuousConvMode.val(conf.continuous_conv_mode) |
     dma.val(conf.dma) |
     dmaConfig.val(conf.dma_config) |
     overrunMode.val(conf.overrun_mode)
    ).update();

