centrevillage/igb_sdk/igb_stm32/periph/adc.hpp
    AdcCommon adc_common;
    adc_common.clockMode(conf.clock_mode);
    adc_common.vrefint(conf.vrefint);
    adc_common.temperatureSensor(conf.temperature_sensor);
    adc_common.vbat(conf.vbat);
    enableRegulator();
    delay_msec(2);

    seqChLength((sizeof...(pin_confs)) - 1);
    _setSeqOrders(0, pin_confs...);
    //(seqChLength.val(0) | seqOrder1Ch.val(static_cast<uint32_t>(pin_conf.ch))).update();

    _initChannels(pin_confs...);

    startCalibration(AdcCalibrationType::singleEnded); // TODO: to be capable differencial

    delay_msec(2);

    enable();

    while(!is(AdcStatus::ready)) {}
  }

  IGB_FAST_INLINE bool checkReady() {
    return is(AdcStatus::ready);
  }

  IGB_FAST_INLINE bool checkEndOfConversion() {
    if (is(AdcStatus::endOfConversion)) {
      clear(AdcStatus::endOfConversion);
      if (is(AdcStatus::endOfSeqConversions)) {
        clear(AdcStatus::endOfSeqConversions);
      }
      return true;
    }
    return false;
  }
};

#endif // STM32F3 || STM32G431xx

#if defined(STM32H750xx)

enum class AdcStatus : uint32_t {
  ready                  = ADC_ISR_ADRDY,
  endOfSampling          = ADC_ISR_EOSMP,
  endOfConversion        = ADC_ISR_EOC,
  endOfSeqConversions    = ADC_ISR_EOS,
  overrun                = ADC_ISR_OVR,
  injectedEndOfConversion = ADC_ISR_JEOC,
  analogWatchdog1        = ADC_ISR_AWD1,
  analogWatchdog2        = ADC_ISR_AWD2,
  analogWatchdog3        = ADC_ISR_AWD3,
  injectedQueueOverflow  = ADC_ISR_JQOVF,
  ldoReady               = ADC_ISR_LDORDY,
};

enum class AdcCommonStatus : uint32_t {
  readyOnMaster                      = ADC_CSR_ADRDY_MST,
  endOfSamplingOnMaster              = ADC_CSR_EOSMP_MST,
  endOfConversionOnMaster            = ADC_CSR_EOC_MST,
  endOfSeqConversionsOnMaster        = ADC_CSR_EOS_MST,
  overrunOnMaster                    = ADC_CSR_OVR_MST,
  injectedEndOfConversionOnMaster    = ADC_CSR_JEOC_MST,
  injectedEndOfSeqConversionOnMaster = ADC_CSR_JEOS_MST,
  analogWatchdog1OnMaster            = ADC_CSR_AWD1_MST,
  analogWatchdog2OnMaster            = ADC_CSR_AWD2_MST,
  analogWatchdog3OnMaster            = ADC_CSR_AWD3_MST,
  injectedQueueOverflowOnMaster      = ADC_CSR_JQOVF_MST,
  readyOnSlave                       = ADC_CSR_ADRDY_SLV,
  endOfSamplingOnSlave               = ADC_CSR_EOSMP_SLV,
  endOfConversionOnSlave             = ADC_CSR_EOC_SLV,
  endOfSeqConversionsOnSlave         = ADC_CSR_EOS_SLV,
  overrunOnSlave                     = ADC_CSR_OVR_SLV,
  injectedEndOfConversionOnSlave     = ADC_CSR_JEOC_SLV,
  injectedEndOfSeqConversionOnSlave  = ADC_CSR_JEOS_SLV,
  analogWatchdog1OnSlave             = ADC_CSR_AWD1_SLV,
  analogWatchdog2OnSlave             = ADC_CSR_AWD2_SLV,
  analogWatchdog3OnSlave             = ADC_CSR_AWD3_SLV,
  injectedQueueOverflowOnSlave       = ADC_CSR_JQOVF_SLV,
};

enum class AdcInterruptType : uint32_t {
  ready                       = ADC_IER_ADRDYIE,
  endOfSampling               = ADC_IER_EOSMPIE,
  endOfConversion             = ADC_IER_EOCIE,
  endOfSeqConversions         = ADC_IER_EOSIE,
  overrun                     = ADC_IER_OVRIE,
  injectedEndOfConversion     = ADC_IER_JEOCIE,
  injectedEndOfSeqConversions = ADC_IER_JEOSIE,
  analogWatchdog1             = ADC_IER_AWD1IE,
  analogWatchdog2             = ADC_IER_AWD2IE,
  analogWatchdog3             = ADC_IER_AWD3IE,
  injectedQueueOverflow       = ADC_IER_JQOVFIE,
};

// H7: ADCALLIN enables linearity calibration (bit 16 in CR)
enum class AdcCalibrationType : uint32_t {
  singleEnded               = 0,
  differentialEnded         = ADC_CR_ADCALDIF,
  singleEndedWithLinearity  = ADC_CR_ADCALLIN,
  differentialWithLinearity = ADC_CR_ADCALDIF | ADC_CR_ADCALLIN,
};

enum class AdcRegulatorState : uint32_t {
  clear   = 0,
  enable  = 1,
  disable = 2,
};

// H7: DMNGT[1:0] in CFGR replaces DMAEN + DMACFG
enum class AdcDmngtConfig : uint32_t {
  noTransfer  = 0,
  dmaOneShot  = ADC_CFGR_DMNGT_0,
  dfsdm       = ADC_CFGR_DMNGT_1,
  dmaCircular = ADC_CFGR_DMNGT_0 | ADC_CFGR_DMNGT_1,
};

// H7: RES[2:0] is 3-bit (bits 4:2 of CFGR); 16-bit is default (000)
enum class AdcResolution : uint32_t {
  _16bit = 0,
  _14bit = ADC_CFGR_RES_0,
  _12bit = ADC_CFGR_RES_1,
  _10bit = ADC_CFGR_RES_0 | ADC_CFGR_RES_1,
  _8bit  = ADC_CFGR_RES_2,
};

enum class AdcExternalTriggerPolarity : uint32_t {
  disable     = 0,
  risingEdge  = ADC_CFGR_EXTEN_0,
  fallingEdge = ADC_CFGR_EXTEN_1,
  bothEdges   = ADC_CFGR_EXTEN_0 | ADC_CFGR_EXTEN_1,
};

enum class AdcOverrunMode : uint32_t {
  keepOldData        = 0,
  overwriteByNewData = ADC_CFGR_OVRMOD,
};

enum class AdcJsqrMode : uint32_t {
  keepOld    = 0,
  discardOld = ADC_CFGR_JQM,
};

// H7: BOOST[1:0] in CR selects operating clock range
enum class AdcBoostMode : uint32_t {
  clock6mhz  = 0,
  clock12mhz = ADC_CR_BOOST_0,
  clock25mhz = ADC_CR_BOOST_1,
  clock50mhz = ADC_CR_BOOST_0 | ADC_CR_BOOST_1,
};

// H7: OVSR[9:0] in CFGR2 — ratio = OVSR+1 (10-bit raw field value)
enum class AdcOverSamplingRate : uint32_t {
  x1    = 0,
  x2    = 1,
  x4    = 3,
  x8    = 7,
  x16   = 15,
  x32   = 31,
  x64   = 63,
  x128  = 127,
  x256  = 255,
  x512  = 511,
  x1024 = 1023,
};

// H7: OVSS[3:0] in CFGR2 — 11 shifts (0=none ... 10=10-bit)
enum class AdcOverSamplingShift : uint32_t {
  none  = 0,
  _1bit,
  _2bit,
  _3bit,
  _4bit,
  _5bit,
  _6bit,
  _7bit,
  _8bit,
  _9bit,
  _10bit,
};

enum class AdcRegularOverSamplingMode : uint32_t {
  continuous    = 0,
  discontinuous = 1,
};

enum class AdcCommonDualMode : uint32_t {
  independent                = 0,
  syncRegularAndInject       = 1,
  syncRegularAndAltenateTrig = 2,
  syncInterleaveAndInject    = 3,
  reserved                   = 4,
  syncInject                 = 5,
  syncRegular                = 6,
  syncInterleave             = 7,
  alternateTrig              = 9,
};

enum class AdcInjectGrpExtTrigMode : uint32_t {
  noTrig      = 0,
  risingEdge  = ADC_JSQR_JEXTEN_0,
  fallingEdge = ADC_JSQR_JEXTEN_1,
  bothEdge    = ADC_JSQR_JEXTEN_0 | ADC_JSQR_JEXTEN_1,
};

// H7: DAMDF[1:0] in CCR replaces MDMA (dual-mode data format)
enum class AdcCommonDamdfMode : uint32_t {
  disable      = 0,
  reserved     = ADC_CCR_DAMDF_0,
  dfsdmFormat  = ADC_CCR_DAMDF_1,
  packing32bit = ADC_CCR_DAMDF_0 | ADC_CCR_DAMDF_1,
};

enum class AdcCommonClockMode : uint32_t {
  async        = 0,
  syncHclkDiv1 = ADC_CCR_CKMODE_0,
  syncHclkDiv2 = ADC_CCR_CKMODE_1,
  syncHclkDiv4 = ADC_CCR_CKMODE_0 | ADC_CCR_CKMODE_1,
};

enum class AdcCommonPrescaler : uint32_t {
  div1 = 0,
  div2,
  div4,
  div6,
  div8,
  div10,
  div12,
  div16,
  div32,
  div64,
  div128,
  div256,
};

// H7: channels 0–19 (ch0 added vs F3/G4 which starts at ch1)
enum class AdcChannel : uint32_t {
  ch0 = 0,
  ch1,
  ch2,
  ch3,
  ch4,
  ch5,
  ch6,
  ch7,
  ch8,
  ch9,
  ch10,
  ch11,
  ch12,
  ch13,
  ch14,
  ch15,
  ch16,
  ch17,
  ch18,
  ch19,
};

// H7 sampling times (fractional ADC clock cycles)
enum class AdcSamplingTime : uint8_t {
  clock1_5   = 0,
  clock2_5,
  clock8_5,
  clock16_5,
  clock32_5,
  clock64_5,
  clock387_5,
  clock810_5,
};

