centrevillage/igb_sdk/igb_stm32/periph/adc.hpp
struct AdcConf {
  AdcResolution resolution = AdcResolution::_16bit;
  bool auto_delay_mode = false;
  uint8_t external_trigger_select = 0;
  AdcExternalTriggerPolarity external_trigger_polarity = AdcExternalTriggerPolarity::disable;
  bool discontinuous_conv_mode = false;
  uint8_t discontinuous_conv_channel_count = 0;
  bool continuous_conv_mode = false;
  AdcDmngtConfig dmngt_config = AdcDmngtConfig::noTransfer;
  AdcOverrunMode overrun_mode = AdcOverrunMode::overwriteByNewData;
  AdcCommonClockMode clock_mode = AdcCommonClockMode::async;
  AdcCommonPrescaler prescaler = AdcCommonPrescaler::div1;
  AdcBoostMode boost_mode = AdcBoostMode::clock6mhz;
  bool vrefint = false;
  bool temperature_sensor = false;
  bool vbat = false;
  AdcCalibrationType calibration_type = AdcCalibrationType::singleEnded;
  bool enable_interrupt = false;
  uint32_t interrupt_bits = static_cast<uint32_t>(AdcInterruptType::endOfConversion);
  uint8_t interrupt_priority = 1;
  uint8_t lshift = 0; // CFGR2.LSHIFT[3:0]: left-shift result 0–15
  // oversampling (CFGR2.ROVSE / OVSR / OVSS)
  bool oversampling_enable = false;
  AdcOverSamplingRate oversampling_rate = AdcOverSamplingRate::x1;
  AdcOverSamplingShift oversampling_shift = AdcOverSamplingShift::none;
};

struct AdcCommon {
  constexpr static auto addr = ADC12_COMMON_BASE;

  RegEnum<IGB_ADC_COMMON_REG_ADDR(CCR), ADC_CCR_DUAL_Msk, AdcCommonDualMode> dualMode;
  RegValue<IGB_ADC_COMMON_REG_ADDR(CCR), ADC_CCR_DELAY_Msk, ADC_CCR_DELAY_Pos> samplingPhaseDelay;
  RegEnum<IGB_ADC_COMMON_REG_ADDR(CCR), ADC_CCR_DAMDF_Msk, AdcCommonDamdfMode> damdfMode;
  RegEnum<IGB_ADC_COMMON_REG_ADDR(CCR), ADC_CCR_CKMODE_Msk, AdcCommonClockMode> clockMode;
  RegEnum<IGB_ADC_COMMON_REG_ADDR(CCR), ADC_CCR_PRESC_Msk, AdcCommonPrescaler, ADC_CCR_PRESC_Pos> prescaler;
  RegFlag<IGB_ADC_COMMON_REG_ADDR(CCR), ADC_CCR_VREFEN> vrefint;
  RegFlag<IGB_ADC_COMMON_REG_ADDR(CCR), ADC_CCR_TSEN> temperatureSensor;
  RegFlag<IGB_ADC_COMMON_REG_ADDR(CCR), ADC_CCR_VBATEN> vbat;

  RegValue<IGB_ADC_COMMON_REG_ADDR(CDR), ADC_CDR_RDATA_MST_Msk, ADC_CDR_RDATA_MST_Pos> masterData;
  RegValue<IGB_ADC_COMMON_REG_ADDR(CDR), ADC_CDR_RDATA_SLV_Msk, ADC_CDR_RDATA_SLV_Pos> slaveData;

  IGB_FAST_INLINE bool is(AdcCommonStatus status) {
    volatile bool result = IGB_ADC_COMMON->CSR & static_cast<uint32_t>(status);
    return result;
  }
};

struct AdcPinConf {
  AdcChannel ch;
  GpioPinType pin_type;
  AdcSamplingTime sampling_time = AdcSamplingTime::clock32_5;
};

template<AdcType ADC_TYPE>
struct Adc {
  constexpr static auto type = ADC_TYPE;
  constexpr static auto info = STM32_PERIPH_INFO.adc[to_idx(type)];
  constexpr static auto addr = STM32_PERIPH_INFO.adc[to_idx(type)].addr;
  constexpr static auto addr_CR      = IGB_ADC_REG_ADDR(CR);
  constexpr static auto addr_DR      = IGB_ADC_REG_ADDR(DR);
  constexpr static auto addr_ISR     = IGB_ADC_REG_ADDR(ISR);
  constexpr static auto addr_IER     = IGB_ADC_REG_ADDR(IER);
  constexpr static auto addr_CFGR    = IGB_ADC_REG_ADDR(CFGR);
  constexpr static auto addr_CFGR2   = IGB_ADC_REG_ADDR(CFGR2);
  constexpr static auto addr_SMPR1   = IGB_ADC_REG_ADDR(SMPR1);
  constexpr static auto addr_SMPR2   = IGB_ADC_REG_ADDR(SMPR2);
  constexpr static auto addr_PCSEL   = IGB_ADC_REG_ADDR(PCSEL);
  constexpr static auto addr_LTR1    = IGB_ADC_REG_ADDR(LTR1);
  constexpr static auto addr_HTR1    = IGB_ADC_REG_ADDR(HTR1);
  constexpr static auto addr_SQR1    = IGB_ADC_REG_ADDR(SQR1);
  constexpr static auto addr_SQR2    = IGB_ADC_REG_ADDR(SQR2);
  constexpr static auto addr_SQR3    = IGB_ADC_REG_ADDR(SQR3);
  constexpr static auto addr_SQR4    = IGB_ADC_REG_ADDR(SQR4);
  constexpr static auto addr_JSQR    = IGB_ADC_REG_ADDR(JSQR);
  constexpr static auto addr_OFR1    = IGB_ADC_REG_ADDR(OFR1);
  constexpr static auto addr_OFR2    = IGB_ADC_REG_ADDR(OFR2);
  constexpr static auto addr_OFR3    = IGB_ADC_REG_ADDR(OFR3);
  constexpr static auto addr_OFR4    = IGB_ADC_REG_ADDR(OFR4);
  constexpr static auto addr_JDR1    = IGB_ADC_REG_ADDR(JDR1);
  constexpr static auto addr_JDR2    = IGB_ADC_REG_ADDR(JDR2);
  constexpr static auto addr_JDR3    = IGB_ADC_REG_ADDR(JDR3);
  constexpr static auto addr_JDR4    = IGB_ADC_REG_ADDR(JDR4);
  constexpr static auto addr_AWD2CR  = IGB_ADC_REG_ADDR(AWD2CR);
  constexpr static auto addr_AWD3CR  = IGB_ADC_REG_ADDR(AWD3CR);
  constexpr static auto addr_LTR2    = IGB_ADC_REG_ADDR(LTR2);
  constexpr static auto addr_HTR2    = IGB_ADC_REG_ADDR(HTR2);
  constexpr static auto addr_LTR3    = IGB_ADC_REG_ADDR(LTR3);
  constexpr static auto addr_HTR3    = IGB_ADC_REG_ADDR(HTR3);
  constexpr static auto addr_DIFSEL  = IGB_ADC_REG_ADDR(DIFSEL);
  constexpr static auto addr_CALFACT = IGB_ADC_REG_ADDR(CALFACT);
  constexpr static auto addr_CALFACT2 = IGB_ADC_REG_ADDR(CALFACT2);

  // CR
  RegValue<addr_CR, ADC_CR_BITS_PROPERTY_RS, 0> propertyRsClearBits;
  RegFlag<addr_CR, ADC_CR_ADSTART>   convStart;
  RegFlag<addr_CR, ADC_CR_JADSTART>  injectedConvStart;
  RegFlag<addr_CR, ADC_CR_ADSTP>     convStop;
  RegFlag<addr_CR, ADC_CR_JADSTP>    injectedConvStop;
  RegFlag<addr_CR, ADC_CR_DEEPPWD>   deepPowerDown;
  RegFlag<addr_CR, ADC_CR_ADVREGEN>  regulator; // 1-bit in H7
  RegEnum<addr_CR, ADC_CR_BOOST_Msk, AdcBoostMode, ADC_CR_BOOST_Pos> boostMode;
  RegFlag<addr_CR, ADC_CR_ADCALLIN>  linearityCalibration;
  RegFlag<addr_CR, ADC_CR_ADCALDIF>  differentialCalibration;
  RegFlag<addr_CR, ADC_CR_ADCAL>     calibration;

  // CFGR
  RegEnum<addr_CFGR, ADC_CFGR_DMNGT_Msk, AdcDmngtConfig>                        dmngtConfig;
  RegEnum<addr_CFGR, ADC_CFGR_RES_Msk,   AdcResolution>                          resolution;
  RegValue<addr_CFGR, ADC_CFGR_EXTSEL_Msk, ADC_CFGR_EXTSEL_Pos>                  externalTrigSelect;
  RegEnum<addr_CFGR, ADC_CFGR_EXTEN_Msk,  AdcExternalTriggerPolarity>             externalTrigPolarity;
  RegEnum<addr_CFGR, ADC_CFGR_OVRMOD_Msk, AdcOverrunMode>                         overrunMode;
  RegFlag<addr_CFGR, ADC_CFGR_CONT>                                                continuousConvMode;
  RegFlag<addr_CFGR, ADC_CFGR_DISCEN>                                              discontinuousConvMode;
  RegFlag<addr_CFGR, ADC_CFGR_AUTDLY>                                              autoDelayMode;
  RegValue<addr_CFGR, ADC_CFGR_DISCNUM_Msk, ADC_CFGR_DISCNUM_Pos>                discontinuousConvChannelCount;
  RegFlag<addr_CFGR, ADC_CFGR_JDISCEN>                                             injectedDiscontinuousMode;
  RegEnum<addr_CFGR, ADC_CFGR_JQM_Msk,    AdcJsqrMode>                            jsqrMode;
  RegFlag<addr_CFGR, ADC_CFGR_AWD1SGL, false>                                     watchdog1ForAllCh;
  RegFlag<addr_CFGR, ADC_CFGR_AWD1EN>                                              regularWatchdog1;
  RegFlag<addr_CFGR, ADC_CFGR_JAWD1EN>                                             injectWatchdog1;
  RegFlag<addr_CFGR, ADC_CFGR_JAUTO>                                               autoInjectGroupConv;
  RegValue<addr_CFGR, ADC_CFGR_AWD1CH_Msk, ADC_CFGR_AWD1CH_Pos>                  watchdog1Channel;
  RegFlag<addr_CFGR, ADC_CFGR_JQDIS>                                               disableInjectQue;

  // CFGR2
  RegFlag<addr_CFGR2, ADC_CFGR2_ROVSE>                                             enableRegularOverSampling;
  RegFlag<addr_CFGR2, ADC_CFGR2_JOVSE>                                             enableInjectOverSampling;
  RegEnum<addr_CFGR2, ADC_CFGR2_OVSS_Msk, AdcOverSamplingShift, ADC_CFGR2_OVSS_Pos> overSamplingShift;
  RegFlag<addr_CFGR2, ADC_CFGR2_TROVS>                                             triggerRegularOverSampling;
  RegEnum<addr_CFGR2, ADC_CFGR2_ROVSM_Msk, AdcRegularOverSamplingMode, ADC_CFGR2_ROVSM_Pos> regularOverSamplingMode;
  RegEnum<addr_CFGR2, ADC_CFGR2_OVSR_Msk, AdcOverSamplingRate, ADC_CFGR2_OVSR_Pos> overSamplingRate;
  RegValue<addr_CFGR2, ADC_CFGR2_LSHIFT_Msk, ADC_CFGR2_LSHIFT_Pos>               lshift;

  // DR (read-only, full 32-bit to support 16-bit result)
  RegValueRO<addr_DR, ADC_DR_RDATA_Msk, ADC_DR_RDATA_Pos> data;

  // SMPR1: ch0–ch9
  RegValue<addr_SMPR1, ADC_SMPR1_SMP0_Msk, ADC_SMPR1_SMP0_Pos> ch0SamplingTime;
  RegValue<addr_SMPR1, ADC_SMPR1_SMP1_Msk, ADC_SMPR1_SMP1_Pos> ch1SamplingTime;
  RegValue<addr_SMPR1, ADC_SMPR1_SMP2_Msk, ADC_SMPR1_SMP2_Pos> ch2SamplingTime;
  RegValue<addr_SMPR1, ADC_SMPR1_SMP3_Msk, ADC_SMPR1_SMP3_Pos> ch3SamplingTime;
  RegValue<addr_SMPR1, ADC_SMPR1_SMP4_Msk, ADC_SMPR1_SMP4_Pos> ch4SamplingTime;
  RegValue<addr_SMPR1, ADC_SMPR1_SMP5_Msk, ADC_SMPR1_SMP5_Pos> ch5SamplingTime;
  RegValue<addr_SMPR1, ADC_SMPR1_SMP6_Msk, ADC_SMPR1_SMP6_Pos> ch6SamplingTime;
  RegValue<addr_SMPR1, ADC_SMPR1_SMP7_Msk, ADC_SMPR1_SMP7_Pos> ch7SamplingTime;
  RegValue<addr_SMPR1, ADC_SMPR1_SMP8_Msk, ADC_SMPR1_SMP8_Pos> ch8SamplingTime;
  RegValue<addr_SMPR1, ADC_SMPR1_SMP9_Msk, ADC_SMPR1_SMP9_Pos> ch9SamplingTime;

