centrevillage/igb_sdk/igb_stm32/periph/adc.hpp
  // SMPR2: ch10–ch19
  RegValue<addr_SMPR2, ADC_SMPR2_SMP10_Msk, ADC_SMPR2_SMP10_Pos> ch10SamplingTime;
  RegValue<addr_SMPR2, ADC_SMPR2_SMP11_Msk, ADC_SMPR2_SMP11_Pos> ch11SamplingTime;
  RegValue<addr_SMPR2, ADC_SMPR2_SMP12_Msk, ADC_SMPR2_SMP12_Pos> ch12SamplingTime;
  RegValue<addr_SMPR2, ADC_SMPR2_SMP13_Msk, ADC_SMPR2_SMP13_Pos> ch13SamplingTime;
  RegValue<addr_SMPR2, ADC_SMPR2_SMP14_Msk, ADC_SMPR2_SMP14_Pos> ch14SamplingTime;
  RegValue<addr_SMPR2, ADC_SMPR2_SMP15_Msk, ADC_SMPR2_SMP15_Pos> ch15SamplingTime;
  RegValue<addr_SMPR2, ADC_SMPR2_SMP16_Msk, ADC_SMPR2_SMP16_Pos> ch16SamplingTime;
  RegValue<addr_SMPR2, ADC_SMPR2_SMP17_Msk, ADC_SMPR2_SMP17_Pos> ch17SamplingTime;
  RegValue<addr_SMPR2, ADC_SMPR2_SMP18_Msk, ADC_SMPR2_SMP18_Pos> ch18SamplingTime;
  RegValue<addr_SMPR2, ADC_SMPR2_SMP19_Msk, ADC_SMPR2_SMP19_Pos> ch19SamplingTime;

  // PCSEL: pre-channel selection (ch0–ch19)
  RegFlag<addr_PCSEL, ADC_PCSEL_PCSEL_0>  ch0PcselEnable;
  RegFlag<addr_PCSEL, ADC_PCSEL_PCSEL_1>  ch1PcselEnable;
  RegFlag<addr_PCSEL, ADC_PCSEL_PCSEL_2>  ch2PcselEnable;
  RegFlag<addr_PCSEL, ADC_PCSEL_PCSEL_3>  ch3PcselEnable;
  RegFlag<addr_PCSEL, ADC_PCSEL_PCSEL_4>  ch4PcselEnable;
  RegFlag<addr_PCSEL, ADC_PCSEL_PCSEL_5>  ch5PcselEnable;
  RegFlag<addr_PCSEL, ADC_PCSEL_PCSEL_6>  ch6PcselEnable;
  RegFlag<addr_PCSEL, ADC_PCSEL_PCSEL_7>  ch7PcselEnable;
  RegFlag<addr_PCSEL, ADC_PCSEL_PCSEL_8>  ch8PcselEnable;
  RegFlag<addr_PCSEL, ADC_PCSEL_PCSEL_9>  ch9PcselEnable;
  RegFlag<addr_PCSEL, ADC_PCSEL_PCSEL_10> ch10PcselEnable;
  RegFlag<addr_PCSEL, ADC_PCSEL_PCSEL_11> ch11PcselEnable;
  RegFlag<addr_PCSEL, ADC_PCSEL_PCSEL_12> ch12PcselEnable;
  RegFlag<addr_PCSEL, ADC_PCSEL_PCSEL_13> ch13PcselEnable;
  RegFlag<addr_PCSEL, ADC_PCSEL_PCSEL_14> ch14PcselEnable;
  RegFlag<addr_PCSEL, ADC_PCSEL_PCSEL_15> ch15PcselEnable;
  RegFlag<addr_PCSEL, ADC_PCSEL_PCSEL_16> ch16PcselEnable;
  RegFlag<addr_PCSEL, ADC_PCSEL_PCSEL_17> ch17PcselEnable;
  RegFlag<addr_PCSEL, ADC_PCSEL_PCSEL_18> ch18PcselEnable;
  RegFlag<addr_PCSEL, ADC_PCSEL_PCSEL_19> ch19PcselEnable;

  // Watchdog thresholds (H7: separate LTR/HTR registers, 26-bit fields)
  RegValue<addr_LTR1, ADC_LTR_LT_Msk, ADC_LTR_LT_Pos> watchdog1LowThreshold;
  RegValue<addr_HTR1, ADC_HTR_HT_Msk, ADC_HTR_HT_Pos> watchdog1HighThreshold;
  RegValue<addr_LTR2, ADC_LTR_LT_Msk, ADC_LTR_LT_Pos> watchdog2LowThreshold;
  RegValue<addr_HTR2, ADC_HTR_HT_Msk, ADC_HTR_HT_Pos> watchdog2HighThreshold;
  RegValue<addr_LTR3, ADC_LTR_LT_Msk, ADC_LTR_LT_Pos> watchdog3LowThreshold;
  RegValue<addr_HTR3, ADC_HTR_HT_Msk, ADC_HTR_HT_Pos> watchdog3HighThreshold;

  // SQR (same as F3/G4)
  RegValue<addr_SQR1, ADC_SQR1_L_Msk,   ADC_SQR1_L_Pos>   seqChLength;
  RegValue<addr_SQR1, ADC_SQR1_SQ1_Msk, ADC_SQR1_SQ1_Pos> seqOrder1Ch;
  RegValue<addr_SQR1, ADC_SQR1_SQ2_Msk, ADC_SQR1_SQ2_Pos> seqOrder2Ch;
  RegValue<addr_SQR1, ADC_SQR1_SQ3_Msk, ADC_SQR1_SQ3_Pos> seqOrder3Ch;
  RegValue<addr_SQR1, ADC_SQR1_SQ4_Msk, ADC_SQR1_SQ4_Pos> seqOrder4Ch;
  RegValue<addr_SQR2, ADC_SQR2_SQ5_Msk, ADC_SQR2_SQ5_Pos> seqOrder5Ch;
  RegValue<addr_SQR2, ADC_SQR2_SQ6_Msk, ADC_SQR2_SQ6_Pos> seqOrder6Ch;
  RegValue<addr_SQR2, ADC_SQR2_SQ7_Msk, ADC_SQR2_SQ7_Pos> seqOrder7Ch;
  RegValue<addr_SQR2, ADC_SQR2_SQ8_Msk, ADC_SQR2_SQ8_Pos> seqOrder8Ch;
  RegValue<addr_SQR2, ADC_SQR2_SQ9_Msk, ADC_SQR2_SQ9_Pos> seqOrder9Ch;
  RegValue<addr_SQR3, ADC_SQR3_SQ10_Msk, ADC_SQR3_SQ10_Pos> seqOrder10Ch;
  RegValue<addr_SQR3, ADC_SQR3_SQ11_Msk, ADC_SQR3_SQ11_Pos> seqOrder11Ch;
  RegValue<addr_SQR3, ADC_SQR3_SQ12_Msk, ADC_SQR3_SQ12_Pos> seqOrder12Ch;
  RegValue<addr_SQR3, ADC_SQR3_SQ13_Msk, ADC_SQR3_SQ13_Pos> seqOrder13Ch;
  RegValue<addr_SQR3, ADC_SQR3_SQ14_Msk, ADC_SQR3_SQ14_Pos> seqOrder14Ch;
  RegValue<addr_SQR4, ADC_SQR4_SQ15_Msk, ADC_SQR4_SQ15_Pos> seqOrder15Ch;
  RegValue<addr_SQR4, ADC_SQR4_SQ16_Msk, ADC_SQR4_SQ16_Pos> seqOrder16Ch;

  // JSQR (same as F3/G4)
  RegValue<addr_JSQR, ADC_JSQR_JL_Msk,      ADC_JSQR_JL_Pos>      injectSeqChLength;
  RegValue<addr_JSQR, ADC_JSQR_JEXTSEL_Msk,  ADC_JSQR_JEXTSEL_Pos> injectGrpExtTrig;
  RegEnum<addr_JSQR,  ADC_JSQR_JEXTEN_Msk,   AdcInjectGrpExtTrigMode> injectGrpExtTrigMode;
  RegValue<addr_JSQR, ADC_JSQR_JSQ1_Msk,     ADC_JSQR_JSQ1_Pos>    injectSeqOrder1Ch;
  RegValue<addr_JSQR, ADC_JSQR_JSQ2_Msk,     ADC_JSQR_JSQ2_Pos>    injectSeqOrder2Ch;
  RegValue<addr_JSQR, ADC_JSQR_JSQ3_Msk,     ADC_JSQR_JSQ3_Pos>    injectSeqOrder3Ch;
  RegValue<addr_JSQR, ADC_JSQR_JSQ4_Msk,     ADC_JSQR_JSQ4_Pos>    injectSeqOrder4Ch;

  // OFR1–4 (H7: 26-bit offset value, SSATE replaces OFFSET_EN)
  RegValue<addr_OFR1, ADC_OFR1_OFFSET1_Msk,    ADC_OFR1_OFFSET1_Pos>    dataOffset1Value;
  RegValue<addr_OFR1, ADC_OFR1_OFFSET1_CH_Msk,  ADC_OFR1_OFFSET1_CH_Pos> dataOffset1Ch;
  RegFlag<addr_OFR1,  ADC_OFR1_SSATE>                                      signedSaturation1;

  RegValue<addr_OFR2, ADC_OFR2_OFFSET2_Msk,    ADC_OFR2_OFFSET2_Pos>    dataOffset2Value;
  RegValue<addr_OFR2, ADC_OFR2_OFFSET2_CH_Msk,  ADC_OFR2_OFFSET2_CH_Pos> dataOffset2Ch;
  RegFlag<addr_OFR2,  ADC_OFR2_SSATE>                                      signedSaturation2;

  RegValue<addr_OFR3, ADC_OFR3_OFFSET3_Msk,    ADC_OFR3_OFFSET3_Pos>    dataOffset3Value;
  RegValue<addr_OFR3, ADC_OFR3_OFFSET3_CH_Msk,  ADC_OFR3_OFFSET3_CH_Pos> dataOffset3Ch;
  RegFlag<addr_OFR3,  ADC_OFR3_SSATE>                                      signedSaturation3;

  RegValue<addr_OFR4, ADC_OFR4_OFFSET4_Msk,    ADC_OFR4_OFFSET4_Pos>    dataOffset4Value;
  RegValue<addr_OFR4, ADC_OFR4_OFFSET4_CH_Msk,  ADC_OFR4_OFFSET4_CH_Pos> dataOffset4Ch;
  RegFlag<addr_OFR4,  ADC_OFR4_SSATE>                                      signedSaturation4;

  // JDR (same as F3/G4)
  RegValue<addr_JDR1, ADC_JDR1_JDATA_Msk, ADC_JDR1_JDATA_Pos> injectData1;
  RegValue<addr_JDR2, ADC_JDR2_JDATA_Msk, ADC_JDR2_JDATA_Pos> injectData2;
  RegValue<addr_JDR3, ADC_JDR3_JDATA_Msk, ADC_JDR3_JDATA_Pos> injectData3;
  RegValue<addr_JDR4, ADC_JDR4_JDATA_Msk, ADC_JDR4_JDATA_Pos> injectData4;

  // AWD2CR: ch0–ch19
  RegFlag<addr_AWD2CR, ADC_AWD2CR_AWD2CH_0>  watchdog2Ch0Enable;
  RegFlag<addr_AWD2CR, ADC_AWD2CR_AWD2CH_1>  watchdog2Ch1Enable;
  RegFlag<addr_AWD2CR, ADC_AWD2CR_AWD2CH_2>  watchdog2Ch2Enable;
  RegFlag<addr_AWD2CR, ADC_AWD2CR_AWD2CH_3>  watchdog2Ch3Enable;
  RegFlag<addr_AWD2CR, ADC_AWD2CR_AWD2CH_4>  watchdog2Ch4Enable;
  RegFlag<addr_AWD2CR, ADC_AWD2CR_AWD2CH_5>  watchdog2Ch5Enable;
  RegFlag<addr_AWD2CR, ADC_AWD2CR_AWD2CH_6>  watchdog2Ch6Enable;
  RegFlag<addr_AWD2CR, ADC_AWD2CR_AWD2CH_7>  watchdog2Ch7Enable;
  RegFlag<addr_AWD2CR, ADC_AWD2CR_AWD2CH_8>  watchdog2Ch8Enable;
  RegFlag<addr_AWD2CR, ADC_AWD2CR_AWD2CH_9>  watchdog2Ch9Enable;
  RegFlag<addr_AWD2CR, ADC_AWD2CR_AWD2CH_10> watchdog2Ch10Enable;
  RegFlag<addr_AWD2CR, ADC_AWD2CR_AWD2CH_11> watchdog2Ch11Enable;
  RegFlag<addr_AWD2CR, ADC_AWD2CR_AWD2CH_12> watchdog2Ch12Enable;
  RegFlag<addr_AWD2CR, ADC_AWD2CR_AWD2CH_13> watchdog2Ch13Enable;
  RegFlag<addr_AWD2CR, ADC_AWD2CR_AWD2CH_14> watchdog2Ch14Enable;
  RegFlag<addr_AWD2CR, ADC_AWD2CR_AWD2CH_15> watchdog2Ch15Enable;
  RegFlag<addr_AWD2CR, ADC_AWD2CR_AWD2CH_16> watchdog2Ch16Enable;
  RegFlag<addr_AWD2CR, ADC_AWD2CR_AWD2CH_17> watchdog2Ch17Enable;
  RegFlag<addr_AWD2CR, ADC_AWD2CR_AWD2CH_18> watchdog2Ch18Enable;
  RegFlag<addr_AWD2CR, ADC_AWD2CR_AWD2CH_19> watchdog2Ch19Enable;

