centrevillage/igb_sdk/igb_stm32/periph/adc.hpp
  // AWD3CR: ch0–ch19
  RegFlag<addr_AWD3CR, ADC_AWD3CR_AWD3CH_0>  watchdog3Ch0Enable;
  RegFlag<addr_AWD3CR, ADC_AWD3CR_AWD3CH_1>  watchdog3Ch1Enable;
  RegFlag<addr_AWD3CR, ADC_AWD3CR_AWD3CH_2>  watchdog3Ch2Enable;
  RegFlag<addr_AWD3CR, ADC_AWD3CR_AWD3CH_3>  watchdog3Ch3Enable;
  RegFlag<addr_AWD3CR, ADC_AWD3CR_AWD3CH_4>  watchdog3Ch4Enable;
  RegFlag<addr_AWD3CR, ADC_AWD3CR_AWD3CH_5>  watchdog3Ch5Enable;
  RegFlag<addr_AWD3CR, ADC_AWD3CR_AWD3CH_6>  watchdog3Ch6Enable;
  RegFlag<addr_AWD3CR, ADC_AWD3CR_AWD3CH_7>  watchdog3Ch7Enable;
  RegFlag<addr_AWD3CR, ADC_AWD3CR_AWD3CH_8>  watchdog3Ch8Enable;
  RegFlag<addr_AWD3CR, ADC_AWD3CR_AWD3CH_9>  watchdog3Ch9Enable;
  RegFlag<addr_AWD3CR, ADC_AWD3CR_AWD3CH_10> watchdog3Ch10Enable;
  RegFlag<addr_AWD3CR, ADC_AWD3CR_AWD3CH_11> watchdog3Ch11Enable;
  RegFlag<addr_AWD3CR, ADC_AWD3CR_AWD3CH_12> watchdog3Ch12Enable;
  RegFlag<addr_AWD3CR, ADC_AWD3CR_AWD3CH_13> watchdog3Ch13Enable;
  RegFlag<addr_AWD3CR, ADC_AWD3CR_AWD3CH_14> watchdog3Ch14Enable;
  RegFlag<addr_AWD3CR, ADC_AWD3CR_AWD3CH_15> watchdog3Ch15Enable;
  RegFlag<addr_AWD3CR, ADC_AWD3CR_AWD3CH_16> watchdog3Ch16Enable;
  RegFlag<addr_AWD3CR, ADC_AWD3CR_AWD3CH_17> watchdog3Ch17Enable;
  RegFlag<addr_AWD3CR, ADC_AWD3CR_AWD3CH_18> watchdog3Ch18Enable;
  RegFlag<addr_AWD3CR, ADC_AWD3CR_AWD3CH_19> watchdog3Ch19Enable;

  // DIFSEL: ch0–ch19
  RegFlag<addr_DIFSEL, ADC_DIFSEL_DIFSEL_0>  diffModeCh0Enable;
  RegFlag<addr_DIFSEL, ADC_DIFSEL_DIFSEL_1>  diffModeCh1Enable;
  RegFlag<addr_DIFSEL, ADC_DIFSEL_DIFSEL_2>  diffModeCh2Enable;
  RegFlag<addr_DIFSEL, ADC_DIFSEL_DIFSEL_3>  diffModeCh3Enable;
  RegFlag<addr_DIFSEL, ADC_DIFSEL_DIFSEL_4>  diffModeCh4Enable;
  RegFlag<addr_DIFSEL, ADC_DIFSEL_DIFSEL_5>  diffModeCh5Enable;
  RegFlag<addr_DIFSEL, ADC_DIFSEL_DIFSEL_6>  diffModeCh6Enable;
  RegFlag<addr_DIFSEL, ADC_DIFSEL_DIFSEL_7>  diffModeCh7Enable;
  RegFlag<addr_DIFSEL, ADC_DIFSEL_DIFSEL_8>  diffModeCh8Enable;
  RegFlag<addr_DIFSEL, ADC_DIFSEL_DIFSEL_9>  diffModeCh9Enable;
  RegFlag<addr_DIFSEL, ADC_DIFSEL_DIFSEL_10> diffModeCh10Enable;
  RegFlag<addr_DIFSEL, ADC_DIFSEL_DIFSEL_11> diffModeCh11Enable;
  RegFlag<addr_DIFSEL, ADC_DIFSEL_DIFSEL_12> diffModeCh12Enable;
  RegFlag<addr_DIFSEL, ADC_DIFSEL_DIFSEL_13> diffModeCh13Enable;
  RegFlag<addr_DIFSEL, ADC_DIFSEL_DIFSEL_14> diffModeCh14Enable;
  RegFlag<addr_DIFSEL, ADC_DIFSEL_DIFSEL_15> diffModeCh15Enable;
  RegFlag<addr_DIFSEL, ADC_DIFSEL_DIFSEL_16> diffModeCh16Enable;
  RegFlag<addr_DIFSEL, ADC_DIFSEL_DIFSEL_17> diffModeCh17Enable;
  RegFlag<addr_DIFSEL, ADC_DIFSEL_DIFSEL_18> diffModeCh18Enable;
  RegFlag<addr_DIFSEL, ADC_DIFSEL_DIFSEL_19> diffModeCh19Enable;

  // CALFACT: 11-bit single-ended and differential factors
  RegValue<addr_CALFACT, ADC_CALFACT_CALFACT_S_Msk, ADC_CALFACT_CALFACT_S_Pos> singleendCalibrationFactor;
  RegValue<addr_CALFACT, ADC_CALFACT_CALFACT_D_Msk, ADC_CALFACT_CALFACT_D_Pos> differentialCalibrationFactor;

  // CALFACT2: linearity calibration (H7 only)
  RegValue<addr_CALFACT2, ADC_CALFACT2_LINCALFACT_Msk, ADC_CALFACT2_LINCALFACT_Pos> linearityCalibrationFactor;

  IGB_FAST_INLINE void enable() {
    // RM0433 §25.4.9: clear ADRDY (write-1-to-clear) before setting ADEN,
    // to avoid false-ready detection on warm re-initialization.
    IGB_SET_BIT(IGB_ADC->ISR, ADC_ISR_ADRDY);
    IGB_MODIFY_REG(IGB_ADC->CR, ADC_CR_BITS_PROPERTY_RS, ADC_CR_ADEN);
  }

  IGB_FAST_INLINE void disable() {
    IGB_MODIFY_REG(IGB_ADC->CR, ADC_CR_BITS_PROPERTY_RS, ADC_CR_ADDIS);
  }

  IGB_FAST_INLINE bool is(AdcStatus status) {
    volatile bool result = IGB_ADC->ISR & static_cast<uint32_t>(status);
    return result;
  }

  IGB_FAST_INLINE void clear(AdcStatus status) {
    IGB_ADC->ISR = static_cast<uint32_t>(status);
  }

  IGB_FAST_INLINE void enableIt(AdcInterruptType interrupt) {
    IGB_ADC->IER = IGB_ADC->IER | static_cast<uint32_t>(interrupt);
  }

  IGB_FAST_INLINE void disableIt(AdcInterruptType interrupt) {
    IGB_ADC->IER = IGB_ADC->IER & ~(static_cast<uint32_t>(interrupt));
  }

  // H7: ADVREGEN is 1-bit; must clear DEEPPWD first (reset state: DEEPPWD=1)
  IGB_FAST_INLINE void enableRegulator() {
    IGB_CLEAR_BIT(IGB_ADC->CR, ADC_CR_DEEPPWD | ADC_CR_BITS_PROPERTY_RS);
    IGB_SET_BIT(IGB_ADC->CR, ADC_CR_ADVREGEN);
  }

  IGB_FAST_INLINE void disableRegulator() {
    IGB_CLEAR_BIT(IGB_ADC->CR, ADC_CR_ADVREGEN | ADC_CR_BITS_PROPERTY_RS);
  }

  // H7: supports ADCALDIF and ADCALLIN for linearity calibration
  IGB_FAST_INLINE void startCalibration(AdcCalibrationType type) {
    IGB_MODIFY_REG(IGB_ADC->CR,
      (ADC_CR_ADCALDIF | ADC_CR_ADCALLIN) | ADC_CR_BITS_PROPERTY_RS,
      ADC_CR_ADCAL | (static_cast<uint32_t>(type) & (ADC_CR_ADCALDIF | ADC_CR_ADCALLIN)));
  }

  IGB_FAST_INLINE void startConversion() {
    (propertyRsClearBits.val(0) | convStart.val(true)).update();
  }

  IGB_FAST_INLINE void startInjectedConversion() {
    (propertyRsClearBits.val(0) | injectedConvStart.val(true)).update();
  }

  IGB_FAST_INLINE void stopConversion() {
    (propertyRsClearBits.val(0) | convStop.val(true)).update();
  }

  IGB_FAST_INLINE void stopInjectedConversion() {
    (propertyRsClearBits.val(0) | injectedConvStop.val(true)).update();
  }

  IGB_FAST_INLINE uint16_t readData() { return data(); }

  static IGB_FAST_INLINE void enableBusClock() {
    STM32_PERIPH_INFO.adc[to_idx(type)].bus.enableBusClock();
  }

  static IGB_FAST_INLINE void prepareGpio(GpioPinType pin_type) {
    GpioPin pin = GpioPin::newPin(pin_type);
    pin.enable();
    pin.setMode(GpioMode::analog);
    pin.setPullMode(GpioPullMode::no);
  }

  static IGB_FAST_INLINE void prepareGpios(auto&& first, auto&&... rest) {
    prepareGpio(first.pin_type);
    prepareGpios(rest...);
  }
  static IGB_FAST_INLINE void prepareGpios() { }

  IGB_FAST_INLINE void _setPcsel(AdcChannel ch) {
    switch (ch) {
      case AdcChannel::ch0:  ch0PcselEnable(true);  break;
      case AdcChannel::ch1:  ch1PcselEnable(true);  break;
      case AdcChannel::ch2:  ch2PcselEnable(true);  break;
      case AdcChannel::ch3:  ch3PcselEnable(true);  break;
      case AdcChannel::ch4:  ch4PcselEnable(true);  break;
      case AdcChannel::ch5:  ch5PcselEnable(true);  break;
      case AdcChannel::ch6:  ch6PcselEnable(true);  break;
      case AdcChannel::ch7:  ch7PcselEnable(true);  break;
      case AdcChannel::ch8:  ch8PcselEnable(true);  break;
      case AdcChannel::ch9:  ch9PcselEnable(true);  break;
      case AdcChannel::ch10: ch10PcselEnable(true); break;
      case AdcChannel::ch11: ch11PcselEnable(true); break;
      case AdcChannel::ch12: ch12PcselEnable(true); break;
      case AdcChannel::ch13: ch13PcselEnable(true); break;
      case AdcChannel::ch14: ch14PcselEnable(true); break;
      case AdcChannel::ch15: ch15PcselEnable(true); break;
      case AdcChannel::ch16: ch16PcselEnable(true); break;
      case AdcChannel::ch17: ch17PcselEnable(true); break;
      case AdcChannel::ch18: ch18PcselEnable(true); break;
      case AdcChannel::ch19: ch19PcselEnable(true); break;
      default: break;
    }
  }

  IGB_FAST_INLINE void _initCh(AdcPinConf pin_conf) {
    uint32_t smp = static_cast<uint32_t>(pin_conf.sampling_time);
    switch (pin_conf.ch) {
      case AdcChannel::ch0:  ch0SamplingTime(smp);  break;
      case AdcChannel::ch1:  ch1SamplingTime(smp);  break;
      case AdcChannel::ch2:  ch2SamplingTime(smp);  break;
      case AdcChannel::ch3:  ch3SamplingTime(smp);  break;
      case AdcChannel::ch4:  ch4SamplingTime(smp);  break;
      case AdcChannel::ch5:  ch5SamplingTime(smp);  break;
      case AdcChannel::ch6:  ch6SamplingTime(smp);  break;
      case AdcChannel::ch7:  ch7SamplingTime(smp);  break;
      case AdcChannel::ch8:  ch8SamplingTime(smp);  break;
      case AdcChannel::ch9:  ch9SamplingTime(smp);  break;
      case AdcChannel::ch10: ch10SamplingTime(smp); break;
      case AdcChannel::ch11: ch11SamplingTime(smp); break;
      case AdcChannel::ch12: ch12SamplingTime(smp); break;
      case AdcChannel::ch13: ch13SamplingTime(smp); break;
      case AdcChannel::ch14: ch14SamplingTime(smp); break;
      case AdcChannel::ch15: ch15SamplingTime(smp); break;
      case AdcChannel::ch16: ch16SamplingTime(smp); break;
      case AdcChannel::ch17: ch17SamplingTime(smp); break;
      case AdcChannel::ch18: ch18SamplingTime(smp); break;
      case AdcChannel::ch19: ch19SamplingTime(smp); break;
      default: break;
    }

    _setPcsel(pin_conf.ch);

    // set single-ended mode (ch19 has no differential mode bit)
    switch (pin_conf.ch) {
      case AdcChannel::ch0:  diffModeCh0Enable(false);  break;
      case AdcChannel::ch1:  diffModeCh1Enable(false);  break;
      case AdcChannel::ch2:  diffModeCh2Enable(false);  break;
      case AdcChannel::ch3:  diffModeCh3Enable(false);  break;
      case AdcChannel::ch4:  diffModeCh4Enable(false);  break;
      case AdcChannel::ch5:  diffModeCh5Enable(false);  break;
      case AdcChannel::ch6:  diffModeCh6Enable(false);  break;
      case AdcChannel::ch7:  diffModeCh7Enable(false);  break;
      case AdcChannel::ch8:  diffModeCh8Enable(false);  break;
      case AdcChannel::ch9:  diffModeCh9Enable(false);  break;
      case AdcChannel::ch10: diffModeCh10Enable(false); break;
      case AdcChannel::ch11: diffModeCh11Enable(false); break;
      case AdcChannel::ch12: diffModeCh12Enable(false); break;
      case AdcChannel::ch13: diffModeCh13Enable(false); break;
      case AdcChannel::ch14: diffModeCh14Enable(false); break;
      case AdcChannel::ch15: diffModeCh15Enable(false); break;
      case AdcChannel::ch16: diffModeCh16Enable(false); break;
      case AdcChannel::ch17: diffModeCh17Enable(false); break;
      case AdcChannel::ch18: diffModeCh18Enable(false); break;
      default: break;
    }
  }

  IGB_FAST_INLINE void _initChannels(auto&& first, auto&&... rest) {
    _initCh(first);
    _initChannels(rest...);
  }
  IGB_FAST_INLINE void _initChannels() { }

