centrevillage/igb_sdk/igb_stm32/periph/adc.hpp
  IGB_FAST_INLINE void _setSeqOrder(uint8_t idx, auto&& pin_conf) {
    uint32_t ch = static_cast<uint32_t>(pin_conf.ch);
    switch(idx) {
      case 0:  seqOrder1Ch(ch);  break;
      case 1:  seqOrder2Ch(ch);  break;
      case 2:  seqOrder3Ch(ch);  break;
      case 3:  seqOrder4Ch(ch);  break;
      case 4:  seqOrder5Ch(ch);  break;
      case 5:  seqOrder6Ch(ch);  break;
      case 6:  seqOrder7Ch(ch);  break;
      case 7:  seqOrder8Ch(ch);  break;
      case 8:  seqOrder9Ch(ch);  break;
      case 9:  seqOrder10Ch(ch); break;
      case 10: seqOrder11Ch(ch); break;
      case 11: seqOrder12Ch(ch); break;
      case 12: seqOrder13Ch(ch); break;
      case 13: seqOrder14Ch(ch); break;
      case 14: seqOrder15Ch(ch); break;
      case 15: seqOrder16Ch(ch); break;
      default: break;
    }
  }

  IGB_FAST_INLINE void _setSeqOrders(uint8_t idx, auto&& first, auto&&... rest) {
    _setSeqOrder(idx, first);
    _setSeqOrders(idx+1, rest...);
  }
  IGB_FAST_INLINE void _setSeqOrders(uint8_t idx) { }

  IGB_FAST_INLINE void init(auto&& conf, auto&&... pin_confs) {
    enableBusClock();
    prepareGpios(pin_confs...);

    if (conf.enable_interrupt) {
      NvicCtrl::setPriority(info.irqn, conf.interrupt_priority);
      NvicCtrl::enable(info.irqn);
      IGB_ADC->IER = IGB_ADC->IER | conf.interrupt_bits;
    }

    (
      resolution.val(conf.resolution) |
      autoDelayMode.val(conf.auto_delay_mode)
    ).update();

    (
      externalTrigSelect.val(conf.external_trigger_select) |
      externalTrigPolarity.val(conf.external_trigger_polarity) |
      discontinuousConvMode.val(conf.discontinuous_conv_mode) |
      discontinuousConvChannelCount.val(conf.discontinuous_conv_channel_count) |
      continuousConvMode.val(conf.continuous_conv_mode) |
      dmngtConfig.val(conf.dmngt_config) |
      overrunMode.val(conf.overrun_mode)
    ).update();

    lshift(conf.lshift);

    if (conf.oversampling_enable) {
      enableRegularOverSampling(true);
      overSamplingRate(conf.oversampling_rate);
      overSamplingShift(conf.oversampling_shift);
    }

    AdcCommon adc_common;
    adc_common.clockMode(conf.clock_mode);
    adc_common.prescaler(conf.prescaler);
    adc_common.vrefint(conf.vrefint);
    adc_common.temperatureSensor(conf.temperature_sensor);
    adc_common.vbat(conf.vbat);

    // H7 startup: clear DEEPPWD, enable ADVREGEN, wait for LDO ready
    enableRegulator();
    delay_msec(2);

    boostMode(conf.boost_mode);

    seqChLength((sizeof...(pin_confs)) - 1);
    _setSeqOrders(0, pin_confs...);
    _initChannels(pin_confs...);

    startCalibration(conf.calibration_type);
    while (IGB_ADC->CR & ADC_CR_ADCAL) {}

    enable();
    while (!is(AdcStatus::ready)) {}
  }

  IGB_FAST_INLINE bool checkReady() {
    return is(AdcStatus::ready);
  }

  IGB_FAST_INLINE bool checkEndOfConversion() {
    if (is(AdcStatus::endOfConversion)) {
      clear(AdcStatus::endOfConversion);
      if (is(AdcStatus::endOfSeqConversions)) {
        clear(AdcStatus::endOfSeqConversions);
      }
      return true;
    }
    return false;
  }
};

#endif // STM32H750xx

#undef IGB_ADC_REG
#undef IGB_ADC_REG_ADDR
#undef IGB_ADC

#undef IGB_ADC_COMMON_REG
#undef IGB_ADC_COMMON_REG_ADDR
#undef IGB_ADC_COMMON

}
}

